{"title":"Can Stress make your health breakdown?","thread":[{"content":"Hey everyone, Just a question about work related stress. In the last year I have had problems with my teeth and gums, stomach ailments, neck and back pain,and anxiety as well. I have been strssed at work for almost the last 6 mos-1 year. Just wanted to know if anyone else has experienced these types of problems due to stress. I have started to exercise more and take lots of vitamins, as well as just trying to relax and not worry about things so much. Any thoughts are appreciated. All the best","author":"CK40CK","postID":"post1785800","date":"20050307-22:48:00 -0500","authorID":"http://www.healthboards.com/boards/members/ck40ck.html"},{"content":"I have had everything from headaches, severe chest pains, neck pains, general aches and pains, nausea, stomach aches and crippling anxiety from stress . I don't think I even realised that all these ailments were a result of stress, especially since my stress was completely random and unfounded, the only real way I could deal with it at that time was medication. Now I have found that exercise, cutting out caffiene, sleeping enough and eating right can make a huge difference aswell as magnesium supplements. I only experienced real, true stress for a few months. I can fully bet that prolonged stress could destroy your health if you don't deal with it.","author":"kittyfairie","postID":"post1785965","date":"20050407-05:05:00 -0400","authorID":"http://www.healthboards.com/boards/members/kittyfairie.html"},{"content":"Oh, most definitely! Stress wears down your immune system. When you are constantly anxious about something, your sympathetic nervous system goes into hyperdrive and allows us to experience all of the lovely symptoms of the \"fight-or-flight\" response such as increased heart and breathing rates, stomach pain, and shaking extremities. By the time a real illness comes along, our bodies are just too tired from all of the anxiety wear-down, that it has a hard time fighting off simple colds. This is why you get sick a lot when you're stressed. Also, you've said that you've been stressed for over six months. Do you feel irritated? Restless? Unable to sleep or concentrate? Do you feel as if you always have some real-life problem to worry about (i.e. money, work, school, etc.)? If so, you might have Generalized Anxiety Disorder (GAD). Check with your doctor if the persistent worry doesn't go away on its own. -GatsbyLuvr1920-","author":"GatsbyLuvr1920","postID":"post1788116","date":"20050507-10:39:00 -0400","authorID":"http://www.healthboards.com/boards/members/gatsbyluvr1920.html"},{"content":"YEP! but only if you let it. All workplaces have rules ,It sounds like harassment to me .","author":"willbee","postID":"post1796150","date":"20050807-20:17:00 -0400","authorID":"http://www.healthboards.com/boards/members/willbee.html"},{"content":"Hello,im 32 And My Life Is Stress,i Sit Home All Day Long And Get Bored And Stress About Things ,i Fight With My Husband Everyday About Sillt Things,i Have Noticed That Im Short On Breath It Comes Whenever,sometimes When Im Just Sitting On The Pc Or Watching Tv,this Morning It Came After I Had Some Coffee,i Drink Soda None Stop Every Day Never Any Water Or Juice,could My Short Breath Be Because Of All The Caffeine Or Stress Or Could I Be Sick In My Lungs????i Hope Someone Can Explain This To Me Im Geting Little Scared Here.","author":"turgutalp","postID":"post1796976","date":"20050907-09:29:00 -0400","authorID":"http://www.healthboards.com/boards/members/turgutalp.html"},{"content":"I ache, get a swollen throat, my neck feels all swollen and my mouth becomes a mess when I become stressed. I have been through the most stressed, anxiety ridden time of my life, which is about to culminate in either a positive or negative answer. And the stress has peaked again and im back to square one. Your body will do anything you want (or dont want) it to. Jon.","author":"MrJon","postID":"post1804094","date":"20051207-17:08:00 -0500","authorID":"http://www.healthboards.com/boards/members/mrjon.html"},{"content":"Turgutalp, Stress can certainly cause you short of breath! Everything starts to tighten up just as stress can give you headaches along with MANY other ailments. I know how you feel.I sit at home too and the more time I have on my hands, the more I stress about things. Keep busy and you will notice that you'll get tired from being busy as opposed of fighting with hubby because of things that you have thought about all day! Good Luck to you!!!","author":"singer1","postID":"post1815009","date":"20060507-18:36:00 -0400","authorID":"http://www.healthboards.com/boards/members/singer1.html"},{"content":"Quote: Originally Posted by GatsbyLuvr1920 Oh, most definitely! Stress wears down your immune system. When you are constantly anxious about something, your sympathetic nervous system goes into hyperdrive and allows us to experience all of the lovely symptoms of the \"fight-or-flight\" response such as increased heart and breathing rates, stomach pain, and shaking extremities. By the time a real illness comes along, our bodies are just too tired from all of the anxiety wear-down, that it has a hard time fighting off simple colds. This is why you get sick a lot when you're stressed. Also, you've said that you've been stressed for over six months. Do you feel irritated? Restless? Unable to sleep or concentrate? Do you feel as if you always have some real-life problem to worry about (i.e. money, work, school, etc.)? If so, you might have Generalized Anxiety Disorder (GAD). Check with your doctor if the persistent worry doesn't go away on its own. -GatsbyLuvr1920- Very good reply, this happened to me 3 years ago, it takes years to make progress and show some recovery from stress, my stress was from harassment at work by a supervisor, I suppose if I had proffessional help I could of made more progress.","author":"Don122756","replyTo":"http://www.healthboards.com/boards/members/gatsbyluvr1920.html","postID":"post2738884","date":"20071101-21:59:00 -0400","authorID":"http://www.healthboards.com/boards/members/don122756.html"},{"content":"I am sick from work harrassmass I've experienced for 4.5 y in a row 14 years ago. There are no rules in any country, exept right is who is more valuable for job at this current moment and best thing you can do is get our of cituation but my problem was that I couldn't. Professionals weren't helping me at all and work problem topic seemed turned them off. May be they were wrong people, good luck to you to find somebody better and never experienced work place harrassment anymore. To summarize what I've heard from therapists: - you should of change the job - somebody else at your place would of change the job where they aren't appreciated.","author":"galinaqt","postID":"post2740227","date":"20071201-14:35:00 -0500","authorID":"http://www.healthboards.com/boards/members/galinaqt.html"},{"content":"I can also relate to some of the things posted here. I had problems at work and as the weeks went by my body felt like it could not cope. I had difficulty getting to sleep each night and would be very tired in the morning, I'd also have a very bad feeling in my stomach hours before work and I was retching. I also didn't eat very much because I just didn't feel like it. In the end I decided to move to a different shift and things improved.","author":"alone86","postID":"post2770493","date":"20090501-14:06:00 -0400","authorID":"http://www.healthboards.com/boards/members/alone86.html"}],"URL":"http://www.healthboards.com/boards/stress/300590-can-stress-make-your-health-breakdown.html"}