{"title":"Osteoarthritis Male, 53, Basal Joint CMC Arthroplasty","threadID":"http://www.healthboards.com/boards/arthritis/941824-male-53-basal-joint-cmc-arthroplasty.html","thread":[{"content":"A friend of mine recommended I check out this forum. It is a wealth of great info with great folks contributing. I noticed that all the people posting on this subject are female. I did some research and found that 75% of CMC arthropasty surgeries are, in fact, female. Further research showed that when it shows up in males it is usually a person who does manual labor such as machinists, mechanics, and plumbers. That fact helped me to start dealing with the \"why me, I'm a guy?\". I would like to share my experience dealing with this condition from a male's perspective. I'm 53. Been a heavy duty auto mechanic for 30 plus years. In relatively good health w/o any physical issues related to my career other than some tendinitis in my right elbow years ago. At this time I'm 2 weeks post surgery. I started having issues approx 2 years ago. Just a general soreness in my left hand. 1 1/2 years ago it seemed to narrow down to my thumb and index finger knuckles. I went to my GP and she suggested anti-inflammatory meds. I forget what she prescribed but it just tore my stomach up so bad I had to discontinue. I toughed it out a few more months just taking ibuprofen. Back to the GP. She ordered x-rays. Came back showing moderate basal joint arthritis. Referred to a hand specialist from the same medical group. Office visit and exam. Doctor seemed to want a quick carpal tunnel diag. I couldn't figure out how that was going to help my thumb pain/arthritis. He suggested a cortisone injection and I agreed. It felt like he was trying to shove a golf ball into my thumb joint. I can't begin to describe how painful that injection was. He basically said because I was a mechanic I would just have to deal with this condition. Cortisone every 4-6 months. I left with a really bad impression of both that doctor and the condition I was starting to deal with. The injection helped for 2 weeks at the most. It was now to the point where I was really worried about continuing my trade. My hands are my paycheck. It got to the point where the pain would be ok early in the work week and by Thursday I was ready for the weekend so my hand could rest up. I'm a avid motorcyclist and pretty much stopped riding because it hurt too much. Riding caused my hand to be really sore at the beginning of the work week because it didn't rest up over the weekend. The condition/pain took over my whole attitude. Felt down and grumpy all the time and it showed. Second opinion with another hand doctor from the same group. He said I should try more cortisone. I declined based on the pain level and short term results of the last one. Besides, cortisone doesn't fix anything. He suggested the only other thing to do was quit wrenching for a living as CMC Arthropasty would not hold up for me with my trade tearing it up. I left his office very frustrated. To say my head was spinning would be a understatement. By this time it got to the point where I would have to stop work for 10-15 minutes at a time to let the pain subside before continuing. I leaned on the shop apprentice more and more to help out. My wife did some research and found my surgeon. He credentials are second to none. Basically he is one of the best hand and arm surgeons in our area. I was really impressed with our first office visit. Finally, I had a good feeling this condition has a resolve and I found the right person to do it. I didn't schedule surgery right then. I wanted to do a little more research on this condition first. It is very important I make the right decision because this affects my career. The pain changed my mind soon thereafter. I was working on a car and pushed with my left index finger and thumb. I popped the thumb joint partially out. The pain put my straight to my knees. That was the last day I worked, 4 weeks ago. I couldn't continue. The slightest pressure on the thumb was extremely painful. The best part about this happening was the fact that now I know, without a shadow of a doubt, that I have no choice but have the joint repaired. Surgery was at one of the best hospitals in our area. The staff was fantastic. It was done as a outpatient day surgery. They were to do a nerve block on the arm and leave me awake but drowsy. Evidently I wasn't drowsy enough so they did full anesthesia. In a blink I was in recovery. First thing I noticed was the cast and then pain. She took care of the pain right away thru the IV. Several hours in post op. Ice chips and later a cold turkey sandwich never tasted so good. I really had no after effects from the anesthesia. Was back home early afternoon. Was prescribed hydrocodone for pain. It seemed to work well enough. Hard to sleep that first night. Woke up the next morning and took 2 hydrocodone pills to get the edge off the pain. Thats the last time I took those. I was having all the classic side effects from that medication and decided I didn't need them anyway. I haven't had pain meds since then except the occasional Tylenol. Surgery cast off and stitches removed one week ago. Things are looking good. Permanent cast put on. Things I've noticed post surgery. The muscle that used to attach to the tendon they cut isn't happy to be idle now. A few times I had really painful cramps in my forearm. This is normal. The other thing that's normal but bugs me is the tip of my thumb is numb.Then just under the first thumb joint it feels like a burn on the skin. Kind of constantly throbbing. They say it will subside. Get a system to protect your cast in the shower. Practice tying your shoes and buttoning your jeans 1 1/2 handed before surgery. Get prepared for the boredom that sets in post surgery and turn it into a positive. I can't wait for PT to start so I have something on my agenda. Overall, I'm really happy to be 2 weeks post surgery. I knew there was no choice but to have this procedure done after I waited so long and lived in so much pain. I'm really looking forward to how well I can rehab this thing. If I can't go back to wrenching then so be it. At least have a repaired joint that will serve me well in normal tasks. I will report back to how well things progress. I hope this thread will help other people going thru the same thing.","author":"d j","postID":"post5143744","date":"20130803-08:05:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Hoping for a quick recovery. Meds sure effect people different. One tramadol works for me, but I know someone who it does nothing for. Also I find taking Motrin or a an Alleve after breakfast most days, lessens the amount of pain meds I take. I have arthitis in my subtalar joint, in my ankle. Surgery is a possibility. I wonder if I will be like you, and say I should have did it years ago. Atleast I hope that is your outcome. Good luck.","author":"Zerk","postID":"post5143967","date":"20130803-14:49:00 -0400","authorID":"http://www.healthboards.com/boards/members/zerk.html"},{"content":"I'm 4 weeks post surgery. Finally got rid of the cast. Feels weird w/o my security blanket on. They custom made a small thumb isolating brace. Doc says it looks good. They gave me a few hand exercises to do until PT starts. PT to start late next week, 5 weeks post surgery. Now I just need to find a good hand specialist at a local PT center.","author":"d j","postID":"post5149829","date":"20140803-12:08:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Been working on my thumb to finger tip touches. Still a few mm away from my ring finger. It's going to be huge to make it over to the pinkie right now. Have to keep setting little goals.","author":"d j","postID":"post5150858","date":"20141003-12:05:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Quote: Originally Posted by d j Been working on my thumb to finger tip touches. Still a few mm away from my ring finger. It's going to be huge to make it over to the pinkie right now. Have to keep setting little goals. Hi d j, You will be able to reach your pinkie. I did 2 years ago after I had surgery on my left hand. I had surgery on my right hand & have now started physio. I read your first post here & want to tell you, you are not alone. True that more women suffer from basal joint problems than men. We tend to over use our hands! You are a prime candidate for this surgery, being a mechanic. You are 100% right, cortisone does not help in the long run. (I was never offered it-would have refused aswell) The best way you can help the skin on your thumb, hand,wrist is to gently massage any oil, olive oil is great, unperfumed body lotion.You need to hydrate your skin-to moisturize it. The numbness you are feeling in your thumb, will subside, in time. There are threads on this forum all about this surgery & the recovery period. I wish you well & continued healing. Haydena.","author":"Haydena","replyTo":"post5150858","postID":"post5151008","date":"20141003-17:41:00 -0400","authorID":"http://www.healthboards.com/boards/members/haydena.html"},{"content":"Thank you so much. I have found this forum so helpful. Just what I needed going through this process. I also have seen this as a way to rededicate myself to total body rejuvenation. I recently joined a health club and can't wait to see results. I have 2 or 3 months before I can return to work so I am going to use this time in a positive way to get healthier. The only thing I'm allowed to do is cardio work which is basically time spent on a treadmill. That's fine for now.","author":"d j","postID":"post5151026","date":"20141003-18:43:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Great to hear you are doing so well. How is the burning pain going on your thumb? If it hasn't settled down yet, you may find that simply putting firm pressure from your hand on it will help. I had the same thing with my knee surgery and I think the pressure from my hand let my brain know that it wasn't injured. Might want to try it. Margarita","author":"margarita889","postID":"post5151176","date":"20141103-07:25:00 -0500","authorID":"http://www.healthboards.com/boards/members/margarita889.html"},{"content":"It's better. Now that the cast is off I have found that the area the pain is felt is the same area were the skin feels numb to the touch. I'm not worried by it. My Doctor, PA, and physical therapist all say the same thing, that it is normal and will improve with time. A few Ibuprofen helps relieve the pain. I have been massaging the thumb and doing my finger tip touches. I finally made it to my ring finger. Next step is pinkie touch.","author":"d j","postID":"post5151198","date":"20141103-08:29:00 -0500","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Quote: Originally Posted by d j Thank you so much. I have found this forum so helpful. Just what I needed going through this process. I also have seen this as a way to rededicate myself to total body rejuvenation. I recently joined a health club and can't wait to see results. I have 2 or 3 months before I can return to work so I am going to use this time in a positive way to get healthier. The only thing I'm allowed to do is cardio work which is basically time spent on a treadmill. That's fine for now. You are welcome, D J When your hand is back to normal you will be able to work out on all the machines! Keeping our bodies active & working out daily, is excellent. Not only is it good for the body, its fantastic for the mind aswell. I'm a great believer in ''staying alive & young.\" For the last 7 weeks I have not driven my car as I am not insured here to drive (with a cast/splint on my hand) I have done alot of walking & managed to drop 7 kilos, much to my delight. Wishing you continued healing & enjoy your days at the health club. Haydena.","author":"Haydena","replyTo":"post5151026","postID":"post5151401","date":"20141103-17:17:00 -0500","authorID":"http://www.healthboards.com/boards/members/haydena.html"},{"content":"Update. I'm now 6 weeks post surgery. I'm going to physical therapy twice a week and today will be my third appt. The therapist says everything looks real good. She asked who the surgeon was and confirmed his outstanding reputation. I have been doing my assigned home exercises religiously. The one thing that really amazed me was how much dexterity I lost while doing the peg board tasks. Everyday tasks are no problem now. Allowances, of course, have to be made toward not lifting too much weight or applying too much pressure to my hand/thumb. I'm sticking to my diet and exercise program. Doing just cardio, for now, at the gym 6 days per week. Feels good. I actually look forward to going to the gym. I only wish the scale showed more results...lol. The only thing that still bothers me is the burning sensation felt the entire length of the thumb along the outward side. Like I said earlier, it feels like a first degree burn on the skin. That same area of skin is still numb to the touch, Just weird. Everyone says that will go away. Next appt. with the surgeon is next week. I'd like to get an idea from him when he thinks I can go back to work.","author":"d j","postID":"post5157440","date":"20130504-06:13:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Great to hear you are doing so well. Hopefully the nerve pain will subside soon. Hope to hear good news after your appointment. Margarita","author":"margarita889","postID":"post5158141","date":"20130604-12:56:00 -0400","authorID":"http://www.healthboards.com/boards/members/margarita889.html"},{"content":"Quote: Originally Posted by d j Update. I'm now 6 weeks post surgery. I'm going to physical therapy twice a week and today will be my third appt. The therapist says everything looks real good. She asked who the surgeon was and confirmed his outstanding reputation. I have been doing my assigned home exercises religiously. The one thing that really amazed me was how much dexterity I lost while doing the peg board tasks. Everyday tasks are no problem now. Allowances, of course, have to be made toward not lifting too much weight or applying too much pressure to my hand/thumb. I'm sticking to my diet and exercise program. Doing just cardio, for now, at the gym 6 days per week. Feels good. I actually look forward to going to the gym. I only wish the scale showed more results...lol. The only thing that still bothers me is the burning sensation felt the entire length of the thumb along the outward side. Like I said earlier, it feels like a first degree burn on the skin. That same area of skin is still numb to the touch, Just weird. Everyone says that will go away. Next appt. with the surgeon is next week. I'd like to get an idea from him when he thinks I can go back to work. I hear you! I am 2 months post surgery & my scar burns as well. Starting in the afternoon, by evening I have applied enough traumeel to slide down the street!. This evening I decided to wrap my lower thumb, half hand, just below the wrist in the piece of material one gets when one has persriciption glasses made from an optician. I felt that the traumeel stayed on my skin & did not get absorbed into this piece of material like it did with a gauze pad. (Traumeel is a homeopathic ointment I have been using for pain, swelling & bruising. I have been told by people on this site that it can be ordered online in the US) I used my hand quiet a lot this morning, only to suffer the consequences in the afternoon. However the burning sensation has cleared up thanks to Traumeel, the opticians glasses' cleaner & a very light cotton bandage, wrapped very lightly around my hand & wrist. My scar is not infected & is healing well. You should be using either Traumeel or a good non-perfumed hand cream for your hand & scar. All scars heal faster & better by being hydrated. As soon as your cast & guard came off, you should have started moisturizing the area of your entire thumb, hand & wrist. I know there is a specific scar cream available & one can purchase it over the counter, here. I intend to buy this scar cream asap to see if it helps the burning when I don't apply the Traumeel. Haydena.","author":"Haydena","replyTo":"post5157440","postID":"post5158144","date":"20130604-13:02:00 -0400","authorID":"http://www.healthboards.com/boards/members/haydena.html"},{"content":"7 weeks post op. Had a great appt with my surgeon today. He was really impressed with my progress and said he might kick me back to work in 4 weeks. Whoo Hoo! I no longer have to wear my removable thumb cast and I'm to start strength conditioning right away. The burning sensation along the length of the thumb is gone. It is still numb along the outward side. This is the same area the burning sensation was. I'm hoping that will improve. I have been doing makeshift exercises at home that copies what i was doing at PT. I think my concentration on constantly working it will pay off in a much faster recovery. It feels great right now. I'm starting to show results from working out at the gym. Excited that I can now add strength conditioning to my work out routine. Doing just cardio gets old but does show results. Overall, I'm so glad to be where I'm at in this process. I guess it shows what one can do when you set your mind to it.","author":"d j","postID":"post5160391","date":"20131104-05:36:00 -0500","authorID":"http://www.healthboards.com/boards/members/d-j.html"},{"content":"Quote: Originally Posted by d j 7 weeks post op. Had a great appt with my surgeon today. He was really impressed with my progress and said he might kick me back to work in 4 weeks. Whoo Hoo! I no longer have to wear my removable thumb cast and I'm to start strength conditioning right away. The burning sensation along the length of the thumb is gone. It is still numb along the outward side. This is the same area the burning sensation was. I'm hoping that will improve. I have been doing makeshift exercises at home that copies what i was doing at PT. I think my concentration on constantly working it will pay off in a much faster recovery. It feels great right now. I'm starting to show results from working out at the gym. Excited that I can now add strength conditioning to my work out routine. Doing just cardio gets old but does show results. Overall, I'm so glad to be where I'm at in this process. I guess it shows what one can do when you set your mind to it. Good to hear about your improvement. The numbness along the outward side, of your thumb will fade. Most likely your doctor will allow you to return to work once the numbness has gone & you have gained all the strength back in your thumb & wrist. Haydena.","author":"Haydena","replyTo":"post5160391","postID":"post5160990","date":"20131204-12:21:00 -0500","authorID":"http://www.healthboards.com/boards/members/haydena.html"},{"content":"Update: Eleven weeks post op. Great news, I'm released to return to work. Whoo Hoo! My physical therapist signed off on returning me to work three days ago. I had my appointment with the surgeon yesterday. He was amazed at my progress. He released me to work with no restrictions. He said to go ahead and use the hand as I normally would on the job, repairing cars, as it will only keep getting stronger. I really think my attitude going into this surgery and recovery process has helped tremendously. My decision to replicate the tasks learned at physical therapy at home and do them every day was huge. It really accelerated my progress. Joining the health club was another great decision on my part. It has many benefits through the recovery. It got me off my butt, out of the house, and moving every day. I lost 15 pounds. My stamina improved dramatically. I was doing cardio for 4 weeks in a cast. As soon as I started physical therapy and learned what I could do to straighten my hand, wrist, and arm I would also do those exercises at the gym. So overall, I was doing physical therapy 7 days a week. 2 with the therapist and 5 on my own. I'm so happy to be at this point only 11 weeks post op. I really feel ready to return to my job. My hands are my paycheck. I'm going to start off easy and see how it goes. I'll keep going to the gym 5 days a week. The whole process has been made a positive. I'll report back in a few weeks.","author":"d j","postID":"post5172344","date":"20130905-06:26:00 -0400","authorID":"http://www.healthboards.com/boards/members/d-j.html"}]}