{"title":"Losing a loved one to lung cancer","thread":[{"content":"Hello, My name is Tigris and I lost my father to lung cancer last year September 15, 2008. He was in statge for non small cell. I dropped him off to get a chest x-ray on August 07, and then that is when his life change and mine as well for a month and atleats two weeks. My father had been smoking for 40 years and has lost his father and brother to lung cancer. I was mad at him because I thought he should had tried to prevent it a lot sooner and he still be here. He died at 58 and to me that is still very young. Well since his passing I appreciate that God allowed me to spend sometime with him and not allow him to die alone. I carry a deep sadness and I know in time I will heal from this. I just feel very disastified and empty because this is my first time experiencing death and being the one to make the decision to take someone off a respirator. Making that decison was not the hardest but I would not want to ever have to do it again is how I feel. But I am sure I will get myself back. So I know that there is someone who can relate to how I feel loosing a parent really hits hard in the gutt","author":"Tigris","postID":"post967428","date":"20090112-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_156234.html"},{"content":"Hi I'm really sorry to hear of your loss - it is very, very difficult to come to terms with the loss of a parent (and lung Ca deaths are far from pleasant). From my recent experience with my Dad (an ex-smoker) and his death from lung cancer, you most definitely made the right decision for him to turn off his respirator - at least you got to make that choice, no matter how hard it was for you. I only wish, with hindsight, that I and my brother could have done the same, rather than watch the end-stage disease. We both can be sure that he has passed into a state where our Dad is free from pain and can admire him for how brave he was until very near the end. He inspired us both to look to the future, though it is with sadness that I remember his death. It DOES get better - but you might need some proper support (don't just go for the counselling) from those who work and practise in end of life / hospice care - they are there to help those of us left behind.","author":"maccyboro","title":"Lung Ca - don't be mad","replyTo":"post967428","postID":"post968559","date":"20090113-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_156725.html"},{"content":"My mother was diagnosed with lung cancer in 2007, she passed away November 2008, the night before Thanksgiving. She was 64 years old and never smoked a day in her life. I am the fifth child of six sibblings. After hurricane Katrina we all relocated to different states, leaving my parents in Louisiana. I reside in Dallas, Tx, and was at work when I received a call from my sister saying that we needed to get to New Orleans as soon as possible. I watched my mother suffer for a week in the hospital before she passed away at the final stage. I am her baby girl and I'm only in my early thirties. It is very hard to accept the fact that she will never dance at my wedding or see my babies born. Life for me now is whatever, whatever. I feel that my mother was robbed of her life by this disease. I often get angry when I see people my age with their grandmothers and mothers, and my mother is gone, and was not very old. It is a shame that we spend millions of dollars on unnecessary things in this country and we can't find a cure to a disease that is claiming the lives of our loved ones.","author":"angel7767","title":"Disease with no cure, broken heart with no hope","replyTo":"post967428","postID":"post974764","date":"20090124-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_159579.html"},{"content":"My name is Karen. My mom was diagnosed with stage 4 lung cancer in June of 2007. She passed away on March 25, 2011. My mom never smoked a day in her life. My father passed away on November 20, 1992. We are alone now without parents, me and my 2 sisters and my younger brother. My mom was only 57. Life is so unfair. My mom lived a very simple and humble life. She was a fighter. So much to see in life and do in life. She loved life. I don't know how to live without my mom. When I am with my kids, I cope, but once they are asleep my mind wonders and I feel very alone. I think about the afterlife and pray that she is with my dad, making up for all the years they lost when he died so young. I miss her so much.","author":"karbrar","replyTo":"post974764","postID":"post1346058","date":"20110408-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_358004.html"},{"content":"I feel your pain, I don't know who you are, where you live or anything about you, but I feel your pain. I am sitting here right now as I write this with the loss of my monther on March 12, 2011 in my arms and I am in bad bad shape. I can't stop crying, my heart is broken into a billion pieces. I feel like no one understands. I LOST MY BEST FRIEND. I am hurting so bad I can barely compose myself. My mom died of lung cancer, a non-smoker, didn't drink, ate right was perfectly healthy and I am angry to the point of no return and I don't understand how she got that terrible disease. I lost my dad in 2004 and to me it's totally different losing my mom and I loved them both the same. Been to my doctor and right now I think I will seek counseling. If anybody reads this please pray for me, I'm losing IT. Need a pen-pal. Read more: Grief and Loss Forum - Lost my Mom 10 weeks ago http://ehealthforum.com/health/lost-my-mom -weeks-ago-t255802.html#ixzz1JTaUOpM9","author":"Basketcase2101","replyTo":"post1346058","postID":"post1349928","date":"20110414-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_360078.html"},{"content":"My Mom too died of Lung Cancer 3 weeks ago on August 25, 2011. She was a non-smoker and not even a 2nd hand smoker. I am angry at the fact that a non-smoker would get lung cancer! I was with her the last day of her life. The pain of seeing her dying was too much to handle. I feel her presence every day, she started kniting a sweater for me while she was going through the treatments, but was never finished; her hand written recipes; the flowers she planted... I can't move on....","author":"yinjun","replyTo":"post1349928","postID":"post1430814","date":"20110916-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_412933.html"},{"content":"My mom was diagnosed Oct. 2010 with stage 4 lung cancer which also spread to the brain. She was given 6 to 12 months to live. My mom passed away a week after her birthday on Feb 16,2011. She only survived 4 months since her diagnosis. I MISS HER LIKE CRAZY. I held her hand till she took her last breath. My life has been a mess since. My mom Helena was only 63. This will be my first birthday, Christmas and new years this month without my mom, my best girlfriend.","author":"Helenasdaughter","replyTo":"post1346058","postID":"post1471119","date":"20111206-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_442786.html"},{"content":"On March 10th 2009 I arrived at my Mother's home in Murfreesboro, TN to witness the end of her life on this earth as a result of stage 4 lung cancer taking over her body. I was heart broken to see her weak, strunken nearly lifeless body knowing that I would soon be standing by her casket aching to have her back. At 9:49 PM my Mother Sandra Kay Brooks York went home to Heaven to the side of Jesus leaving me here to wonder how, when, why and what. How did it get so bad, when did it get so bad, why did it get so bad and what could I have done or why didn't I get there sooner but all the questions in the world won't bring her back. Before my Mother found out she had lung cancer I had quit smoking October of 2002 adding I've been told 10 years of my life for every year I don't smoke which makes me sick to think that my Mother could have done the same thing and chose to do so when it was too late. I plan in the future to remind people that cigarettes took my mother before she was in her 70s as she died at 61 years old. I know I will see her again but knowing she isn't around to talk to in those times I want to share exciting news or ask advise is hard to accept. The pain of losing her I don't think will ever go away and if it does the memory of losing her to lung cancer won't and that makes me angry, that a disease that could have been prevented by the decisions she made killed her and took away the only woman who ever loved me and encouraged me in the times I most needed encouragement. Now I am asking myself, \"Where will I receive the encouragement when I need it when there is no woman in my life I am that close to, as close as I am my own Mother?\" I have two siblings a sister and brother but not close to either one of them as I am the oldest of three. My Mother practically raised my daughter so my daughter considers my Mother her mother taking away my need where others in the family are concerned and projecting it on her leaving me feeling unloved and unwanted so the loss of my Mother includes isolation and abandoment with confusion and disownment as my Mother's daughter. I hate feeling like this and hope anyone with similar experiences contacts me with any advise and or encouragement as I continue on this emotional rollercoaster I am on.","author":"savedXthegraceofGod","title":"Stage 4 lung cancer cause of death of my mother.","replyTo":"post967428","postID":"post1000363","date":"20090319-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_172213.html"},{"content":"my father was diagnosed with lung and bone cancer september 2005 and died october 2005. it was so sudden but watching him suffer in pain and agony for that one month felt like an eternity. my mom never got over the death him even though it's been almost 4 years. i still find her bursting into tears while she is cooking or working. i still find myself tearing up because although he wasn't my biological father, to me he was my daddy because he took me in with unconditional love. in the hospital he had introduced me to the nurse as his daughter, something he had never done before. and the last thing he said to me before he had slipped into a coma was that he thought i was the most beautiful thing that he had ever seen. it really is the hardest thing i ever had to go through and i wish no one has to ever go through but it is an inevitable thing, to lose a loved one.My life has never or will ever be the same again, my family fell apart, he isn't going to be there to watch me graduate from high school or visit universities with me. although time has healed some of the pain, it still hurts.","author":"barbiegirl91","replyTo":"post967428","postID":"post1014879","date":"20090417-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_179468.html"},{"content":"Hello everyone, Lung cancer is the worse I think.I lost both of my parents to lung cancer.My dad had asbestoes he was a mechanic and it seems the break pads had asbestoes in them.My Mother followed him 8 years later.Both smoked and both quit but it was to late.I held my Mom in my arms as she took her last breath.From the day we found out she had lung cancer till she died it was 7 weeks.Savedxthegrace of God I do know how you are feeling.I blammed everyone for this I yelled at God and I beat myself up for 2 years over this.In the last 13 years I have lost both parents 2 uncles and 1 aunt to cancer.Heart disease. has claimed 2 aunts in the past 3 years.Hospice is a wonderful thing and for all who need to talk to someone about the loss of a loved one they are there for you.My Mothers lung cancer started in her left lung when she died it had sperad to her bones, her liver, her blood the other lung and her kidneys and finally her brain.It was devestating to watch this I loved her so much.","author":"shy57","title":"loosing a loved one to lung cancer","replyTo":"post967428","postID":"post1021320","date":"20090430-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_182436.html"},{"content":"Hi everyone, My name is Jo, Im a 37year old mum of two. And.....well Im just so lost!!!!! My mum pasted away on 19th April 09 and Im just feeling worse as the days are going on. My mum Lynn, was 55years old, 7 years ago she was diagnosed with breast cancer, she had a lumpectomy and radio therapy and she was given the all clear 18 months ago. Christmas last year she started having bouts of her feet swelling up and she started loosing abit of weight, we took her numerous times to the doctor to which we were told that it was artheritis. After about 10 different lots of anti biotics that did nothing, we took her to our local A & E, where she was admitted for further tests. She had numerous test done and was told that she had lung cancer, to which she was devastated to say the least. The following 9 weeks consisted of her in and out of hospital, having her lung drained and managed to have ONE dose of chemotherepy....after that she was just too weak, her body started breaking down and she was just loosing so much weight. Eventually the hospital said that they wanted her to go into a hospice to \"build herself up for chemo\" The doctors wouldnt really give me a streight answer, but I could see she was getting worse with my own eyes. I was told by mums Macmillan nurse that they only thought she about 8 weeks, mum was in the hospice 1 week, I went in the morning on the Saturday and I just knew that this was it!!! Her breathing had changed, I asked for the doctor to examine her and she told me to expect it at any time....she was going away... they told mum what was happening and that they were going to put a driver into her arm. It was pure hell! mum just kept looking at me and we were both crying. I called all my family and all mums brothers and sisters(7 in total) they all came up to spend time with her. Myself, mums partner of 23 years, and 2 of my brothers spent that night with her just taking turns to hold her in our arms, talking to her all night. On the Sunday morning mum deteriorated and the final breathing stage came. There were 18 people in the room and I had her in my arms, everyone was crying.....but I couldnt..she was just making that horrible noise and I didnt want her to be afraid, so I just talked and talked to her. Telling her how much we all loved her and that she wasnt alone.....after 45mins if this.....my beautiful most precious mum died in my arms. At this point...I collasped. Its 2 months on Sunday and Im feeling so lost and missing her more than I could ever put into words. She was my best friend. We used to spend most days together. Mum had me at the age of 16 and it was always us together!!!! People keep saying things like \"things will feel better in time\" and \"at least she's not suffering\" but I know these things are true. But Im just utterly devastated. My husband and children are great but I just feel like my insides are being ripped out. I just dont know what to do! Im on sleeping tablets, which help, but Im just sobbing all the time! Does enyone out there feel like this?? Jo xxxx","author":"jazzybay","title":"My beautiful mum","replyTo":"post967428","postID":"post1042571","date":"20090610-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_192884.html"},{"content":"I know how each of you feel loosing a parent.I have lost both of mine and even though I can make it day to day now there will always be a emptyness and a spirit that will never be the same.I was such a momma's girl and when she died it took my life away from me.I agree with you angel7767 we send people to outer space and spend billions of dollars on programs in this country while we let cancer rob us of life. jazzybay jo when I read your post I cried because yes I have felt this way and what people are sayikng is true but it takes a long time to get to the point where the hurt is not as raw as now.With me after 3 years I started coming back a little but dont let anyone fool you it is never as it once was and people who say time will heal all wounds that is not true either the wounds will always be there but you learn to cope better dont rush yourself take time to greive and let God comfort you.If you need someone to talk, write me, I will be glad to talk with you barbiegirl91: yes your correct the pain is bad and I feel bad for you because your so young.My dad who passed away in March 95 adopted me when I was 09 and even though he was not my bio dad he was my dad.I could have never loved any dad as much as I did him.I miss him so much and it has been 14 years and I still miss him so much good luck to you and I hope in life his love and smiles to you guide you and help you through times where you will need him. as for me I was not mad at my Mother I seen how she struggled to stay alive I was mad at God but I soon found out God is in control now and forever.However I did get mad at my Dad because I lived in another state and visited as often as I could but I was not there when he passed but the next day when I arrived I seen my Mothers face and it was a sadness I had never seen before I seen her cry and stare into space she loved him so much so I got mad at my Dad for leaving her.How silly I was.When my Dad passed away I was 38 and when my Mother passed away I was 45.I still hurt so deep and find myself looking at the pictures and remembering each snapshot and how happy everyone was.But we do learn to cope with day to day life again and remember the happy times and not the sickness so much.To each of you who hurt and cant see past today just give yourself some more time and you will be better....never the same as you once were but better God Bless You All","author":"shy57","title":"lung cancer","replyTo":"post967428","postID":"post1042619","date":"20090610-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_182436.html"},{"content":"Tomorrow I will bury my wife of 23 years. She died in my and our daughter arm. She was only 57 years old. It was very difficult to say the least. She was diagnosed a little over three years ago with stage 4 lung cancer. I guess I should feel lucky that she lived that long and took those times to make her as happy as possible by traveling together and going to Broadway plays along with other things. But when her time got closer I couldn''t stay strong any longer and cried like I never cried before. Weeks before she had spoken with her doctor about being comfortable if and when the time came. We agreed she wouldn''t suffer. It is so unbelievable when you lose a loved especially when it your wife. I keep saying to myself it''s just ain''t fair, but I trying my hardest to just remember the good times and there are many. She was my best friend and I''ll never find another like her.","author":"ks115","title":"My lovely wife","replyTo":"post967428","postID":"post1189643","date":"20100408-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_267182.html"},{"content":"My husband has just been diagnosed and I am dying inside. He too has been my best friend for 44 years..Just don't know how I will do it.","author":"Marylon","title":"Lung CA","replyTo":"post1189643","postID":"post1505469","date":"20120208-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_467499.html"},{"content":"My Son who is 47 has stage 4 lung cancer. He was diagnosed a year ago April 1/09. He has been getting chemo and radiation since and seems to be holding his own but we know it is only a matter of time. I have many questions but mostly I wonder if someone who has already gone through this can tell me what to expect when our Son is at the end. We have heard it is horrible pain and suffering. Is that how the end will be for him. I need to know so I can be somewhat prepared and so I can know how to pray. My name is Pat.","author":"allmyheart","replyTo":"post967428","postID":"post1198262","date":"20100427-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_271865.html"},{"content":"Hi Pat, if you need to talk to someone I'm here for you. My mom passed away March 12, 2011 and she was pain free until the day she passed, in fact she used a pain med only once and that was the day she passed. Keep your head up every case is different.","author":"Basketcase2101","replyTo":"post1198262","postID":"post1349934","date":"20110414-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_360078.html"},{"content":"pat....the pain meds are amazing but its sooo horrible the same to watch a loved one pass on or suffer. i lost my father in dec 2012 to lung cancer. i was with him 24 hrs a day for weeks and never left his side. JUST BE there as much as you can. The hospice for my dad was the best place and their sooo wonderful . A great support and will make the last moments comfortable for him. the end is the worst moment ...the breathing changes and losing someone you love...no words to describe. iam sooo sorry for your son and for yur family. BUT always keep your faith and know hes always with you in spirit. Monica","author":"mohnie3","title":"lung cancer","replyTo":"post1198262","postID":"post1553326","date":"20120427-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_501404.html"},{"content":"I amsorry to hear that you also lost your father recently....I unfortunately, am still in the process of grieving....I lost both my parents recently to Non small cell lung cancer. My father was diagnosed in May 2009 and he passed away in December,2009. He had full blown cancer in his upper left lung, 4 weeks later the hospital found out that my mother had the same lung cancer, but in her right lung and it was only small...but she ended up getting MRSA in the lungs in the cancer. She passed away the night before I planned to go away on a cruise, that was the 22 February this year.....Because of their age and their health they could only have radiation therapy. I still cannot beleive that they are both gone, nor can I beleive that they both ended up with the same lung cancer but in different lungs. I thank god every day that they went peacefully. Dad ended up with the cancer going to his brain, the doctors called us in late and told us that he had taken a siezure, he looked so frail and old, we didnt think he would pull through...but he did, he lasted 3 weeks then he just stopped breathing, it was so natural(he was in pallative care at the time). Mum she was watching TV and just drifted off, my brother tried to wake her to see if she wanted a cup of tea....but she was gone....she was a home and we had to ring the doctor, the worst was that she had to stay in the house till the next morning...as we hadn't arranged her funeral stuff....My youngest brother is intellectually disabled and this affected him a lot. Now all the family has to pull together to look after him, that is what is important.....family.","author":"sogden2007","replyTo":"post967428","postID":"post1219888","date":"20100615-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_275305.html"},{"content":"My father, 47, died yesterday of lung cancer. He was diagnosed in April of this year (2010). He died Nov. 2. It is horrible. He was a very heavy smoker from the time he was 14. I prayed my entire life that he would quit. He did, but it was too late. I too, am a smoker. I hate it! I find it sooo hard to quit, despite everything that has happened. I am so sad. My heart is broken. He was so tired and weak, and every breath was labored. I miss him so much already and it's only been a day! He was a Christian, so I know that he is home and not suffering any longer, but I still wish he could be here with me. I've always been a daddy's girl, and now my daddy is gone. I know the pain will ease up over time, but I don't know that it's even sunk in yet that he's gone. I still have the actual funeral to deal with. I pray that God will give me the strength to quit smoking before it's too late for me and my husband as well. I ask for anyone's prayers who is willing to give them. Thank you.","author":"sunshnlvr","replyTo":"post967428","postID":"post1280793","date":"20101104-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_320088.html"},{"content":"I am so sorry to everyone who has suffered a loss. Bless you all. I myself am going through a difficult time, but I do not smoke. My best friend does. He refuses to quit and I am sick with worry for his health. He is eighteen and has already been smoking for five years. I am also his fiance. Yes, we're young, but that is not important now. What is important is his life. I love him so much and feel tormented by this, especially since he doesn't seem to care. I want to help him so badly, but I don't know what to do. He parents are not the understanding type, and I do not live close enough to distract him from cravings. Please, I'm desperate for advice. Thank you.","author":"help2131","title":"Please Help","replyTo":"post967428","postID":"post1313932","date":"20110201-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_339266.html"},{"content":"Sometimes the people we love do things that make us crazy. My advice would be to have him read some of the stories on this forum. Since he's been smoking I'm sure he's been constantly nagged and told to quit so by now he is probably tuning it out. He needs to see and hear of real life experiences and maybe he will understand how important he is to you and how important it is for him to quit.","author":"HopefullyThisHelps","replyTo":"post1313932","postID":"post1375746","date":"20110601-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_376216.html"},{"content":"Hello everyone xx I have lost both my parents to lung cancer. My father died in 1995 from the disease. My precious mother passed away 14th April, 2010. She was diagnosed with lung cancer in March 2009, she came to live with me in August of that year and progressively became worse. The cancer had spread to her brain - this was terrible to witness as my mother's personality changed from being my walking encyclopedia to child like. She did undertake radiation therapy for both the lung and brain however it was only palliative only. She died peacefully with one of my brothers and myself present. I am very heart broken and miss her terribly and as it is coming closer to her 1st anniversary I am re-living the pain again. My parents both smoked. My husband's father also died from cancer, which had spread to his liver and that is what took him after only 6 wks of diagnosis - he didn't smoke nor drink alcohol. It is very hard to come to terms with our parents dying. The pain never goes away - it only lessons. Celebrate their lives and take care of yourselves too, this is important. love from spam unapproved xxx","author":"fillet","replyTo":"post967428","postID":"post1328669","date":"20110305-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_348059.html"},{"content":"Hi all, I am 23 years old, and like many of you, I am grieving the loss of a loved one: my mum whom passed away 1 1/2 months ago. It all started about 3 1/2 years ago, when my mum was having pains in her pelvic area. After several tests, she was diagnosed with stage IV non-small cell lung cancer and given 6 months to live. When we first heard, we were all devastated but at the same time we were determined to beat this cancer. She was always extremely positive about her situation and tried to stay extra healthy, eating well, exercising constantly and just making the most of life. At first, she did extremely well on treatment, however, it was the last 6 months before her death that the treatment was no longer holding the cancer and it was doing more harm than good. She stopped treatment at that point and we looked after her at home which was extremely horrible to watch. The pain that a cancer patient goes through is just horrifying and one would never think about the complications that occur until it actually happens. We all stayed at her bed and held her hand until she took her very last breath on 2nd April 2011. I still remember that day so clearly and miss her so very much. There are days where I really wish I could just hear her voice or her laughter filling up our house.... One of the biggest frustrations of dealing with my mum having lung cancer was the lack of empathy and support she got as a lung cancer patient. Many people believe that lung cancer is caused by smoking and that individuals deserve what they get because they ignored the health warnings. My mum was never a smoker. In addition, I have found out that less than 1% of all people that smoke actually develop lung cancer. I am biologist and know that a good scientist would say never say that smoking causes cancer with those statistics in mind. And for those smokers that do develop cancer: who says that they shouldn't be given a second chance anyway? A person who commits murder is given a chance to stand trial and they serve their sentence and then are given a second chance at life. There is absolutely no research going into early diagnoses for lung cancer in spam unapproved, even though it is the number one cause of all cancer deaths, which is probably mostly due most lung cancer patients being diagnosed at the incurable stage. I wish that the ads campaigns would focus less on smoking causing lung cancer (which we knew from the 1970s and is very very old news) and more on early diagnoses so that other people would be saved the fate that my mum experienced. No one deserves to die like that ... Anyway, I hope that everyone in this forum can find some comfort and also learn to cope with losing their loved one. I am still learning to cope ....","author":"findingpeace","title":"Lung cancer frustrations","replyTo":"post967428","postID":"post1374884","date":"20110531-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_375763.html"},{"content":"My mother was just diagnosed with lung and brain cancer in august of 2011 she's still smoking and fighting my father was a smoker and died of throat cancer well an infection helped him die and I blame myself everyday I was a month away from being 20 know I'm 26 I've been smoking since I was 11 I can't quit I want to but the addiction is strong I'm against taking pills due to a couple of suicide attempts thanks to prozac and I don't no the long term effects no one does I really think its more than smoking our food contains so many chemicals preservetives , not to mention bug sprays , same crap they put in cigarettes I'm really messed up in the head I already had cancer cells growing in my body a couple of times due to bad pap smears I had a couple of surgerys for it , my brother died in 1990 he was almost 4 I was 5 yrs. Old I always blamed myself because I fed him a baby bottle that he choked on and that was the last thing I remembered know I blame myself for my father he had an septic infection growing from a surgery for his throat cancer. I thought he was out of it he was yelling 9:00 for some odd reason and died 9:00 at the hospital I thought it was his meds I hate myself I recently had a dream about him and he wasn't happy with me I woke up scared I sometimes feel that something evil I's around me its confusing if you know the feeling of someone staring at you and you look and no ones there ,my sister right now is fighting an heroine addiction I feel like I only have my kids they see me down a lot and I hate that I wanna go on forever but no one listens","author":"mzcoleman","replyTo":"post1374884","postID":"post1471630","date":"20111207-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_443123.html"},{"content":"My mom was diagnosed oct. 2010 with stage 4 lung cancer which also spread to the brain. She was given 6 to 12 months to live. My mom passed away a week after her birthday on Feb 16,2011. She only survived 4 months since her diagnosis. I MISS HER LIKE CRAZY. I held her hand till she took her last breath. My life has been a mess since. My mom Helena was only 63. This will be my first birthday, christmas and new years this month without my mom, my best girlfriend.","author":"Helenasdaughter","replyTo":"post967428","postID":"post1471121","date":"20111206-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_442786.html"},{"content":"i miss my mother who raised 3 boys on her own. she lost her leg when i was 5 i am the oldest. i had to grow up quick. my father was in prison 40 yrs of my 47 on this earth. i married my highschool sweetheart. at 41 she had to have open heart surgery a triple bypass . a defective gene inherited from her dad. i could go on and on about my life without faith and a shoulder to lean on the loss can be unbearable. seek counseling. talk to some one ,anyone. my mom was 56 yrs young. the lord will always be ther to comfort us and embrace our loved ones when they pass. god loves us, what else is there to put our faith in ?","author":"kaman","replyTo":"post967428","postID":"post1567545","date":"20120523-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_510343.html"},{"content":"My father passed away over the weekend April 26th, 2014. I will always remember the look of exhaustion on his face changing to a more peaceful state after his last breath. Watching him suffer and enduring the pain was unbearable. I will be scarred for life. He battled till the end and we stayed with him until the end. He was diagnosed late with stage iv lung ca. It had spread to his lymph and his rib cage. In his last week leading up to his passing it started with him not being able to swallow to the point where he could not eat with the breathing difficulties and gasping. It was a nightmare. He did not eat anything until his passing and his mouth was open all the time. I had to moisten his mouth. I had access to a vacuum to suction out particles in his throat and tried to keep his throat as clean and moist as possible. I always changed his pampers as I had him in the hospital not the hospice. Before his last day I washed his body with moist towel and made sure he was clean. I shaved him as well and put some after shave on him and he gave that tingled expression which was the last normal reaction I got from him. I told him again I loved him. The next day I was pulling up to the hospital as the doctor called saying he may pass at any moment. I got upstairs just in time to hold him for his last couple of breaths and he passed in my arms. I was so relieved that his suffering ended with his passing. But now I am reliving the moments and find my self losing it. This disease takes more than life it destroys a person and the loving relatives of the affected. I'm not sure how I feel. I hope not to witness this again and wish those suffering to have speedy ending.","author":"cidr","title":"lung Ca is torture","replyTo":"post967428","postID":"post1802943","date":"20140428-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_690780.html"}],"URL":"http://ehealthforum.com/health/losing-a-loved-one-to-lung-cancer-t164724.html"}