{"title":"Does the Lucinda Bassett program work?","thread":[{"content":"I stumbled across a few posts referencing the Lucinda Bassett program (Midwest Center for Stress and Anxiety).  Browsing the net, I was skeptical as to the validity of the reviews for the program.  I was wondering if any of you have tried the program.  For those of you who have, how would you rate the program and were the results significant and sustained?","author":"ryn21","postID":"post_2837941","date":"20080428-00:00:00 -0400","authorID":"/personal_pages/user/97676"},{"content":"Does it \"work.\" Yeah, it works really well for her -she's making money on that stuff. Does it work for others? The answers range from \"never\" to \"sometimes\" to \"always.\" Just for fun, let me do a search on Ebay and see what we come up with (goes to Ebay). I see that the price on her web site is 8 easy payments of about $60 each -that's $480 buckos. And I see that Ebay has it for about half that or less. So that gives you of an idea of how the market values it when a \"free economy\" is involved. And I also see that to even FIND the price on her web site involves some digging -so it appears to me she's a bit nervous about presenting her price right up front (and she's all about NOT being nervous -go figure). But lets get down to cases here: meds don't \"work,\" therapy doesn't \"work,\" books and CD's don't \"work,\" and nothing at all just \"works\" all by itself. It's not like a solar powered outdoor light that you stick in the ground and it just sort of lights up by itself at night. The WORK is done by YOU; your brain changes and heals just like a broken leg or blister -the solution is all inside of YOU. The meds, the CD's, the books and baying at the moon while throwing chicken bones on the ground are ALL TOOLS. I'm not just trying to make fun of this stuff -really I'm not. I'm trying to get across the point of view that puts you -puts anybody- in the best position to understand the entire approach to recovery. And so, back to our friend Lucinda: if her approach -the workbooks, the carry cards, the CD's and all the rest of it \"connect\" with you in terms of how you would feel best about handling your recovery, then give it a shot (but do it at Ebay). But bear in mind that there are no medicinal or magical properties to the 75 cents worth of plastic and paper you'll get. If it \"works\" at all, it will do so because YOU did the work. My own approach was to use a psychiatrist - a living, breathing human who could respond to me in real time. I would have gone nutz digging out a wallet card of things to say to myself, or dashing home or to my car to listen to a CD. But THAT may be your cup of tea! If it is, pour it on. Just understand that YOU do the \"work.\" OK? OK!","author":"JSGeare","replyTo":"ryn","postID":"post_2842396","date":"20080429-00:00:00 -0400","authorID":"/personal_pages/user/366811"},{"content":"Amen!!! Sadly...all of these anxiety treatments are so popular...b/c when we are \"suffering\" with panic/amxiety....we want a quick/fast/miracle/easy/instant cure!!  JS is right....it takes time, and regardless of WHAT treatment route you take....it is YOU that does the work and has to make the changes from inside out. I look at all of the other things (treatment modalities for anxiety) as basically a crutch for a broken leg.  The crutch will certainly help you through the healing process....but if you don't get the fracture REPAIRED, the crutches are not very worthwhile.  Right?","author":"nursegirl6572","replyTo":"ryn","postID":"post_2842418","date":"20080429-00:00:00 -0400","authorID":"/personal_pages/user/480448"},{"content":"While I agree completely with the responses above, I must chime in here to relay my experience with Lucinda's program.  When I ordered the program I was housebound (agoraphobic), unable to drive, and having multiple panic attacks on a daily basis.  I knew I needed help and being that my finances wouldn't allow me to seek the professional help I needed and the fact that I was choosing to remain med-free, I decided to give the program a shot.  By the end of the program I was taking advantage of every opportunity to leave my house, I was driving again, and the daily panic attacks disappeared.  The program truly did give me my life back.  But all that said I must admit that the anxiety is still with me, the program didn't \"cure\" me, and I know that I still have lots of work to do before I can say I am fully recovered.  What I am getting at here is if you are housebound, or cannot afford to see a psychologist/psychiatrist, then by all means give it a try!  Don't expect it to be a miracle cure, but you will feel increasingly better as the weeks go by. Hope this helps you and that you feel better soon! Cori","author":"be still my beating heart 13","replyTo":"/personal_pages/user/97676","postID":"post_2848113","date":"20080430-00:00:00 -0400","authorID":"/personal_pages/user/213375"},{"content":"Once again, JS is right on the money. I once thought about trying the Lucinda Bassett program, but something told me there was something a little off with it. I mean, why is this lady on TV so much and have so many ads, etc? That shows me that it is a money thing, not a helping thing. The best things in life really are free (or at least low cost). This may not surprise anyone who knows me on here, but I would recommend you go to the library or bookstore and get a copy of \"Hope and Help for your Nerves\" by Dr. Claire Weekes. To emphasize JS's message, this is not a cure all (nothing is), but it helps get you in the frame of mind that you need to be in - this is an illness and can be cured (or at least coped with easily). I have had GAD for more than 7 years now and have tried so many things, so I think by the time I read this book I was READY to be done with it. This book has seriously changed my life. I am nearly 100% anxiety free (on most days) and really have my life back. Again, I am not preaching Gospel here or anything nor am I the man with the magic elixir, but hey - reading this can ONLY help and will not hurt at all. Good Luck and remeber, until you realize that it is inside of you to heal this thing and it is a state of mind (and that state of mind is that you WANT to get better) anxiety will win every time. So don't let it. Mike","author":"shelzmike","replyTo":"/personal_pages/user/97676","postID":"post_2848670","date":"20080430-00:00:00 -0400","authorID":"/personal_pages/user/299912"},{"content":"I just had to post a response since I have had amazing results with the Lucinda Bassett program.  I picked it up on eBay for about half of the full $500 and it was a little bit older than the program they have now I think.  I don't think there have been any substantial changes in a while though. I'm 40 this year and had been to countless psychiatrists and therapists in the last ten years or so with little or no benefit.  I've read just about every self help book in existence including the Hayes book mentioned above with little or no benefit.  I've been on a dozen or so anti anxiety and depression meds with little or no benefit but the program worked wonders for me. Your mileage may vary, what works for one might not work for another but the program was my last resort and saved me.  Good luck and don't give up, keep looking and eventually you'll find what works _for you_.","author":"mixmaster","replyTo":"/personal_pages/user/97676","postID":"post_3415779","date":"20080917-00:00:00 -0400","authorID":"/personal_pages/user/622748"},{"content":"I have tried everything even that program and what worked for me was starting a vitamin and mineral supplement eating more fish and veggies.I would write in a notebook but never go back and read it burn it throw it away something.I promise I didn't go to the store my husband did all of that for 4 years I was a hermit and barely went out alot before that.But getting a better diet and exercise helped I was so scared of having  a panis attack I was scared to exercise and make my heart go fast.One thing I told myself is so what if I pass out or have a heart attack they will call an ambulance and all will be fine.I think getting closer to God and having a true friend also helped me a great deal.I have been there and wasted so much money on things even doctors and I had the power to change it all by myself.I take a childrens vitamin and mineral way less expensive and does what it is supposed to take an extra vitamin d and natural calm by peter gillham is a lifesaver the stuff really worked go to ebay or choicenutritionals.com to get it at a great price this stuff is better than taking any pill and is natural.Please don't waste your money on those things if you ever take advice take this you have the power to change your life it is all up to you.","author":"bbygrl4u","postID":"post_3416764","date":"20080917-00:00:00 -0400","authorID":"/personal_pages/user/531653"},{"content":"I did just get their \"free\" trial in the mail.  I think all I've done is create more stress because my husband is now mad at me for trying something when I've not exhausted all the resources of the military network.  I think I'm going to send it back but could you send me the info on the download.  That might be an option.  My e-mail is ***@****.  I need some help my husband is deploying to Iraq and I'm scared to death I'm going to have another panic attack that could put me in the hospital.  I have a child now.  Anyways any help or suggestions would help.","author":"Angcskin","replyTo":"/personal_pages/user/614250","postID":"post_3449474","date":"20080925-00:00:00 -0400","authorID":"/personal_pages/user/630911"},{"content":"I am agree that all depends of you, even when you go to the therapist. So from this point of view, yes you have to work, nobody will do the job for you. But this is one of the best practical material that ever found. Nothing was invented but it summarise important things to deal with. The main point is negative thoughts and how to deal with. So please, try it. It will be helpfull in some way. Use your search tool for Internet for \"Attacking Anxiety & Depression Audio Tracks\" and you will find the way to download. Good luck from Argentina","author":"JoseTony","replyTo":"/personal_pages/user/630911","postID":"post_3598812","date":"20081031-00:00:00 -0400","authorID":"/personal_pages/user/667949"},{"content":"I am currently working on this program and feel it is helping ALOT.  Ebay has it really cheap...did not know that until I bought it for like 600 bucks...but hey...seems to help...","author":"crystalhanzelka","replyTo":"all","postID":"post_3599207","date":"20081031-00:00:00 -0400","authorID":"/personal_pages/user/634091"},{"content":"I lived with serious anxiety issues for about 7 years, starting in my early twenties.  I never wanted to admit that I wasn't happy or that I may have a problem.  I finally decided I couldn't live like that any longer and decided to get some help a year ago. At the time, I didn't want to go to therapy, so I ordered Lucinda Bassett's program and began doing the work.  I never knew that you could control your thoughts and learned how to repattern my brain and calm myself through the exercises in her program.  The program was a jumping off point for me.  I then dealt with some issues I had head on.  After that, I started seeing a therapist who does resonance repatterning (feel free to google it).  I also read Eat, Pray, Love and Eckhart Tolle's book A New Earth.  Those books helped me tremendously.  I've learned a lot from Oprah's Live Webcast with Eckhart Tolle and her interviews with other people on her Soul Series.  I've been in therapy now for 9 months and I can't tell you how much better I feel.  I started taking responsibility for my feelings and my mental health one year ago, and because of all of the things I listed above, I am an even better version of myself than I used to be when I was younger.  It is a process and it takes time and it's a hard road, but it can be done.  I did all of this without any drugs, which is my own personal choice.  I think it's different for everyone so you have to find things that work for you.  I also believe that meditation helps quiet the mind and connect you with God, which has brought me a lot of peace.  Back to Lucinda's program... I definitely think it helps and is worth trying.  I wish everyone good luck, love and peace!","author":"junolct","replyTo":"all","postID":"post_3648361","date":"20081112-00:00:00 -0500","authorID":"/personal_pages/user/680291"},{"content":"It's funny how people criticize programs like this and call them scams and ripoffs and at the same time they offer their own remedies and so called cures instead.Even though they may not make any money doing it they are doing the exact same thing they are complaining about.Their just pissed that someone other than themselves is making money helping people.","author":"DARRYL21270","replyTo":"All","postID":"post_3783797","date":"20081218-00:00:00 -0500","authorID":"/personal_pages/user/713605"},{"content":"pay attention!! Whether this program is true or false is not the issue! at all! It is hard to stop a routine whether it is a bad one or a good one. We all suffer from anxiety in one way or another. But if we can just stop long enough to see the problem, then the problem can be dealt with, and most of the time, cured. My method is lots of prayer, a healthy dose of certain vitamins and minerals i.e. B6,B12,D and Magnesium. So, just try this you might be suprised at the results. Oh by the way did I mention you need a friend who you can freely talk with and be able listen to you. Acousticman","author":"acousticman","replyTo":"Everyone suffering Anxiety..","postID":"post_3791409","date":"20081220-00:00:00 -0500","authorID":"/personal_pages/user/715211"},{"content":"Everyone suffers from anxiety and depression at some time, however when it remains a controlling factor in your life and starts to interfere with how you live your life or even prevent you from activities then its time to get help. This is a fifteen week program that helps you attain skills to stop your panic attacks or other symptoms you may have. My fiancé actually ordered the program after having an panic attack and I am going through the program as well so that I may better understand the condition. I am finding that I too have the condition in certain aspects and have benefited from just the first three weeks. To the persons who note Ebay and the selling of the product I would point out that the program is updated so you may be getting an older version of the program (thus the price cut). The workbooks that come with the program are key to success as started several times in the audio and video program so be sure to get and use them! For the person who argues the infomercial and advertisement programs... well we can all look at the Bowflex and how long they have been advertising, its because the product works. I too was skeptical for a long time due to the price and the exaggerated promises, however just like this program if you stick to the guidelines it will work. Diet and exercise and cutting off the caffeine and sugars will help reduce and or eliminate some of the anxious feelings you may have (as stated in the program) but the program will certainly help you attain those skills needed to understand why you are feeling the way you are and to change them, for this the program is priceless.","author":"dean85","postID":"post_3804253","date":"20081224-00:00:00 -0500","authorID":"/personal_pages/user/718027"},{"content":"I am Roger in Texas and have tried many different things. I am 50 now and have suffered with depression and many other of its terrible side effects. I just wanted everyone who sees this to  'PLEASE '  pray for Roger so that he will get better and at least get better enough to keep going. Thanks to you all who pray for me , Merry  CHRIST mas  to you and yours and may  2009 be Blessed.","author":"rogerandsally","replyTo":"ALL READERS","postID":"post_3804607","date":"20081224-00:00:00 -0500","authorID":"/personal_pages/user/718097"},{"content":"I have Lucinda's program and I belong to the chat forums.  Many of people have recovered using it.  I didnt finish it, but what I did do did help me.  It takes time and patience's.  If you feel you want to try it, go for it.  There is a 30 day free trial.  ","author":"CG822","replyTo":"everyone","postID":"post_3805508","date":"20081225-00:00:00 -0500","authorID":"/personal_pages/user/693413"},{"content":"I downloaded the program after having started sessions with a therapist 6 months earlier (and making SLOW progress). I followed the instructions precisely and used the tapes and workbook religiously. I saw rapid improvement and drastic changes after the first six weeks, which continued until I finished the program. That was in June 2008 and though I still might have occasional feelings of anxiety, I feel I can handle it without fear. One thing I think every person should consider is how much they desire to get over their anxiety and depression. I had hit rock-bottom and worried about whether or not I was making real progress with my therapist when I started it. I've tried passing this program on to a couple of other people and they all thought it was corny or stupid and quit. Being a skeptic myself, I realize I would have quit this program as well if I had not reached dire levels of depression and agoraphobia. Seeing how much I had sunk made me commit to the program no matter how silly I might have thought certain parts of it were. For this program to give you any benefit, you are required to have an open mind about what it tries to teach you. I believe that a committed person will get a lot from the program alone, but seeing a therapist in addition to the program will be more beneficial. My therapist had me learning some CBT techniques, but they were disjointed and unstructured. It was the structure of Lucinda's program that made a difference for me. However, an important part of my recovery was having a therapist. Certain questions came up for me in the program that my therapist was able to help me with even though she was unfamiliar with the program I was using. The program is great, but having a professional to help guide you is necessary as well. Considering how beneficial the program was to my overall success over the most debilitating aspects of my panic and anxiety, it would have been worth spending the money to the buy the program instead of downloading it. I'm even considering buying the program anyways so that the makers will get some compensation for the help they've given me.","author":"drdoombot","replyTo":"Those Wondering About Lucinda's Program","postID":"post_3819365","date":"20081230-00:00:00 -0500","authorID":"/personal_pages/user/722118"},{"content":"Yes! It works. It changed my life. I am angered that there are people saying it is a scam. It is not.  You could have charged me $4000 and I would have paid. It is worth every penny.  If it didn't work for you, it is because you were not ready to change.  No one can change you, but you.  Lucinda shows you how to change yourself! Lucinda is a Godsend.","author":"gizelle","replyTo":"To those criticizing Lucinda's program","postID":"post_3865339","date":"20090112-00:00:00 -0500","authorID":"/personal_pages/user/733970"},{"content":"Ok, HereS MY ADVICE OF HER PROGRAM. I ALSO ORDERED HER PROGRAM IN LIKE JAN OF 09\" i think it doesnt really help me that well... I believe negative thinkers; or anxiety and depression comes from experiences; It has something to do with abuse... either being physically, emotionally or sexually abused...Thinking is not the root of anxiety and depression at all... It's just you have to think about the things you want in life; but it needs counseling and a lot of therapy. People who have anxiety and depression are prone to see what they really like and dislike... It also involves being a an abusive household that has nothing to do with u. Not the child's fault for bad parenting... hope that helps:D","author":"Susan08","postID":"post_4002030","date":"20090218-00:00:00 -0500","authorID":"/personal_pages/user/769031"},{"content":"I also bought this program.  They don't tell you that although you have the option to return it, you have to pay around 15.00 to do so.  And, they are very hateful when you ask them about that.  They told me that if I didn't like it, all it would cost me was the 14.95 to ship to me.  What a crock.  The whole thing is a crock.   Cristy","author":"Cris182","postID":"post_4085246","date":"20090312-00:00:00 -0400","authorID":"/personal_pages/user/791798"},{"content":"I not only bought the program, but I'm also reading her book, \"From Panic to Power\".  I honestly do think that if you are skeptical about the program and its results, then you aren't going to get the results you want.  You need to go into it with an open mind, and tell yourself that you are ready to make some changes in your life.  I used to suffer from anxiety, and panic attacks on a daily basis.  Everything I've read has helped to change how I think.  I feel like a new person, and I enjoy life so much more than I ever have before.  I feel like I can take on the world.  And all I had to do was think positive.  Best of luck.","author":"candiceskye","postID":"post_4093738","date":"20090315-00:00:00 -0400","authorID":"/personal_pages/user/794222"},{"content":"This program saved my life. I was 20 when I started getting real bad panic attacks and thought I was loosing my mind.  I didn't know what anxiety disorder was at the time, and this was the first thing that I came across that I could identify with what they were talking about.  I never did finish all the tapes in the program, as I felt I didn't need to, but you do have to be strict with the program or don't bother. I guess it depends on how badly you want to get better?  I still have the tapes and just knowing I have them eases my anxiety to this day.  I am now 31, and I don't have panic attacks anymore (knock on wood).  It's all thanks to this program.  I do still feel anxious, but I know how to control the feeling.  Really, anxiety is all related to your thoughts, and if you know how to control them life will be much more pleasant.  If you think the price is expensive then I guess you have to ask yourself how much do you value the happiness and calmness in your life? Really I think it is a small price to pay for a life of happiness. Feeling sceptical is normal seeings how there is so many bad programs out there, but I can assure you this is not one of them! I still use techniques from the program to help me get through some of my struggles, such as flying.  I won't be able to travel if I never had bought these tapes, and that would be very sad considering all the wonderful things I have seen in my life so far!  Good luck, be happy and the calmness will follow. Hope this helps you!","author":"happy2BAlive12345","postID":"post_4111055","date":"20090320-00:00:00 -0400","authorID":"/personal_pages/user/799048"},{"content":"I tried Lucinda's program as well as numerous others over the years. In the end, I was left with a little less money and still have my anxiety and panic. Download it for free if you can and give it a try but I would not spend the money for her program.","author":"VirtualReality23","postID":"post_4115882","date":"20090321-00:00:00 -0400","authorID":"/personal_pages/user/791584"},{"content":"While many are trying to prove a scam (or not) let's just say you're all commenting on the value or worth of the product. For those who find help it's invaluable, for others the \"cost\" outways your doubts of the product. But you would still pay that Lawyer $400 for 1/2 hour to try to get off that $125 speeding fine and that's ACCEPTABLE! Now there's a scam. Having listened to Attacking Stress then there are some clear examples that I (you) could follow......and yes you all are correct I could have paid more or even less than this program charges. The question is whether you are prepared to accept advice, and some are clearly in that position so that this series will help {Lucinda or whoever does it). Others are not BUT you did come here to look for advice so admit it you are seeking something. Personally though I find that the technique she uses is nothing new. And if you want a cheaper method look for the book \"Changing Your Life in 7 Days\" by Paul McKenna........pay $15 and get the CD with it. Is she ripping off her peers and the people she learned techniques from???? Give us a break we have ALL done that ...... just look at the way you responded to others posts.","author":"smiffykls","replyTo":"All Above","postID":"post_4433653","date":"20090506-00:00:00 -0400","authorID":"/personal_pages/user/896225"},{"content":"If you just think that using Lucindas program is the end all to end all it isn't-But many years ago when there was no Internet access and many people didn't get what anxiety was about-her program had more value-Now you can find out anything on the Internet so it's a bit outdated","author":"DukePatrol","postID":"post_4720204","date":"20090731-00:00:00 -0400","authorID":"/personal_pages/user/988753"},{"content":"The Lucinda Bassett program is GOOD and it can work for you. I have suffered from severe anxiety/panic for 6 years and I'm here to tell you that it takes hard work and a willingness to follow the program the way it tells you to - one tape a week and work in the workbook. I have studies anxiety extensively and talked to many many people who also suffer. The thing I noticed in this program is that we all have similarities in the way we think and respond to life. The techniques in her program are similar to the ones I have read in books and that my therapist has told me to follow but the way that they are presented in the program are better and easier to practice and they cover many different angles to overcoming anxiety/depression that are important - exercise, nutrition, positive thinking, rational thinking, etc.  It takes attacking anxiety/depression from several angles to beat it. I have been able to go through long stretches with no anxiety but I got back into obsessive thinking, worrying, not exercising, not going to church regularly for about 9 months and the anxiety and panic attacks came back in full force so now I'm going through the steps again to beat it.  You can do it too!","author":"tulip77","replyTo":"Everyone","postID":"post_4781967","date":"20090818-00:00:00 -0400","authorID":"/personal_pages/user/960942"},{"content":"Thanks so much for suggesting other ways to get the same kind of help without shelling out $500 for this program. I've been noticing my anxiety getting worse and worse and I know I need a little help finding ways to manage it but I'm not in a position financially to pay that much for it. I'm going to the bookstore this weekend to look at the 2 books you suggested. Thanks again!","author":"myownperson137","replyTo":"/personal_pages/user/293232","postID":"post_4801022","date":"20090824-00:00:00 -0400","authorID":"/personal_pages/user/1015507"},{"content":"i tried this program, and yes it works only for 1 reazon, the program give to you tools to faith the anxiety, and information to undestend what is this, and how to live with this problem.  As every body see in this letter my english is bad and maybe you dos t undestend  what I tried to say but, before this program I am about to get craizy, o I belive that. bye then my only lenguage was spanish but 1 day I heard about this problem in  a comercial on TV  but sounds familiar to me. I buy the program no matter what and i tried to know what do they say, I need  so badly to know what is happen to me, and over and over and over tried to read the book, lissen the cds and waching the viedos i dont know how many times, with de diccionary on my hands and hope I learn a lot. tanks to this program I know what is this, and I m not afraid any more.  the most sad thing is I could t  find anyting in spanish. and most of the people who suffer of this mental problem think they are posses of any spirit or devil o someting unreal, and  I wish somebody can give this kind of information is spanish ..","author":"lalocota","replyTo":"every body","postID":"post_4862779","date":"20090911-00:00:00 -0400","authorID":"/personal_pages/user/1036548"},{"content":"Hello Everyone, I hope everyone is doing great today, and I would like to share my experience wiith anxiety and Lucinda Bassetts program in general. First, I will sum it up and give you my honest feedback to get to the chase. Then I will go into more detail and share my experience. Here goes : I dont believe Lucinda Bassetts program/ tapes are the most effective. I am sure everyone has different experiences and / or progress. But, I honestly think it is a waste of money and definitely not worth the investment. Why ? 1. There are numerous tapes included. Most people do not have the time to watch all of those tapes and just give up without trying it ! Thats probably why some ppl never had any positive results. Plus, it just added more anxiety and made my condition worse at the time. (which is normal as Lucinda states in the program) As most ppl suffering anxiety, the typical reaction would be :: The thought of not doing it perfectly, re watching the same CD over and over uptil it is fully absorbed , and of course dreading going through the whole process of watching NUMEROUS tapes about ANXIETY, a topic we refuse to ACCEPT or procrastinate about doing ! We have anxiety. At first, it is common to have a negative reaction or it can actually INCREASE your anxiety ! But, when do you see results or have the patience to go STEP by STEP and watch every single tape ? We are expecting instant results 1-2-3 ! Do most of us have the perserverance or positive attitude to go through the whole program simply BELIEVING it will work ? Probably NO, that is why I believe it doesnt work for everyone. 2. I definitely did not watch her whole CDS, and every single tape. Why ? Well, definitely because I couldnt go through another second of her \"physcho babble talk\". I find most of it to be not very helpful or too much filter and very TIME CONSUMING. I think she speaks to you like a \"patient\", that is in a hospital and in the recovery zone. Who wants to feel like they are in a recovery zone and making BABY STEPS to get better each day ? I think she could have summed up her tapes, and made a realistic 1-3 CD program and charged a decent price so more ppl can benefit. I am sure she is aware that most ppl suffering from anxiety will not benefit if they purchase this expensive program. WHY ? Simply, because they probably will NOT go through the whole program STEP by STEP and will give up. Does her nonsense phsycho babble talk in numerous CDS add up ? I definitely dont think so. What do I believe is GREAT about her program ? ( Of course, I dont believe you have to BUY her program to adapt these principles, and can achieve these results on your own of course elsewhere) 1. Accepted that you have anxiety, etc. Accepting it, and loving yourself and understanding you are creative, etc. 2. Understanding the root, cause, and understanding your anxiety, (or whatever) diagnosing the common symptoms, and simply are more aware of anxiety and all of the effects and causes. 3. Googling positive influences that have anxiety, or even bipolar. ( ex. Einstein, Mozart, ) etc. 4. Finding ways to improve your lifestyle to decrease anxiety : dont drink coffee, eat junk food, and maintain a healthy lifestyle. 5. Write a journal everyday and notice progress. She mentions its not great to bottle your emotions inside, or over analzye any situation, etc. 6. You can chat with others who are suffering anxiety. This makes you feel like you are not alone, and understand we have similiar experiences. 7. Meditation. She mentions meditation is very important. I would recommend various meditation links on youtube. (cheaper) Meditation was very helpful. I simply believe that you dont have to purchase her whole CDS, system to recover from anxiety. I believe that if you simply become more aware of your condition, understand it, accept, change your lifestyle a bit, and apply some principles, you can see results. I believe it can be helpful, but I know there are cheaper ways to get results ! Running definitely helped me. Her tapes did help me in many ways. Unfortunately, I didnt go through the whole CDS, but I found help other ways, by googling more about anxiety, changing my diet, became more positive, confident, accepting it, and stop overanalzying things and live for the moment.","author":"kandle37","replyTo":"Ryn and everyone","postID":"post_4941937","date":"20091004-00:00:00 -0400","authorID":"/personal_pages/user/1062949"},{"content":"Be carefull and alert. They try to set you up to pay fees that are not clearly stated and they are nasty about cancelations. You can spend a lot of money to basically hear much about anxiety but it is not clear how much help one gets. They may try to get you to buy supplements and life management counseling from people of unknown backgrounds. For me this program is a cruel scam. They take people that are vulnerable and sneak up on you with expenses. I will probably turn them over a an attorney and/or a consumer reporter.","author":"beau01","replyTo":"ryn1","postID":"post_5076650","date":"20091113-00:00:00 -0500","authorID":"/personal_pages/user/1107061"},{"content":"God, some of the posts here are ridiculous.  In particular, the posts suggesting Lucinda Bassett's program is a scam because of the price.  Christ, I could just as easily say, “You buy bread at the store?  Man, what a scam.  You could grow your own wheat; milk your own cows; grow your own hens for the eggs” you get the point.  Is there a cheaper way to do nearly anything?  Yes, there is.  I take my car to Jiffy Lube to get the oil changed.  Could I do it myself for a few bucks less?  Sure I could, but I don't.  The benefit behind the MWC program is that it is a carefully laid out system.  Not everyone needs this, but there are apparently thousands of people who do.  I've read tons of self-help books on anxiety, including those posted here, and NONE OF THEM lay out a system like the MWC.  The others give tips and strategies, but they don't tell you what you're going to learn from day-to-day, provide exercises to work on, links to a forum or chat room full of people all working on the same program, etc.  Some people like this.  Some people find this beneficial and important for learning to cope with anxiety, stress, and panic disorder.  Some here are suggesting that b/c there are a lot of MWC packages for sale on Ebay it's a worthless program.  What a load of rubbish.  There's A LOT OF EVERYTHING ON EBAY.  For instance, I play guitar.  Paul Reed Smith makes excellent guitars and they are highly coveted.  Well, on any given day I can find 60+ for sale on Ebay.  Does that mean they're crap guitars?  No, not by any stretch of the imagination.  As of this writing I see 53 used copies of Clair Weekes' “Hope and Help For Your Nerves” on Amazon.  Does that mean it's a crappy book?  NO, it just means people have decided to sell it for any number of reasons.   I bought my MWC package used on Craigslist.  The guy who sold it to me went on for at least an hour as to how it saved his life and turned it around.  He claimed to have tried everything, included reading many of the books posted here, and they didn't work for him.  He needed a structured program with a community of people all doing the same thing.  He was selling it with the hopes it would do the same for someone else.  That was his ONLY reason.  I personally have found it very helpful.  I've learned a lot of useful tips from it.  Am I anxiety free?  No, but then no one except perhaps the Dali Lama is anxiety free.  We all feel stress, some more than others.  The question is how one learns to deal with excessive stress which may lead to anxiety or panic attacks.  In that context, the MWC program provides a useful system.  ","author":"kamaboko","replyTo":"All","postID":"post_5130372","date":"20091130-00:00:00 -0500","authorID":"/personal_pages/user/1124206"},{"content":"When I first heard about the program, It was late night, I was depressed and I called, when the phone operator told me the cost, I said, Oh My God, thats too much, I dont have that kind of money...\" The operator said, \"isnt your health worth it?..\" That's when I knew this program wasn't for me. Years later, I downloaded the program, and to be honest, I get nothing out of it. I thought I would at first and took lots of notes, then I started to realize that these folks in group sessions I am suppose to relate to and generally relate to, I simply didnt. I have chronic pain in my body, where is the help for that? Oh there is isnt. I am not like Lucinda, I didnt have an alcoholic father, etc... MY depression and anxiety comes from 10 years of chronic pain. If your situation is like mine, I highly doubt you will get anything from these tapes. Also, as I listened, I always felt she was too assertive to the group, almost as if she would not let the people in the group come up with their own words. She would in a way...\"persuade\" the answer with her leading words....","author":"apple803","replyTo":"Everyone","postID":"post_5238010","date":"20100106-00:00:00 -0500","authorID":"/personal_pages/user/1161782"},{"content":"Hi there, It was very interesting to read through all these responses.  What I gathered form them all is that Lucinda's program works for some and doesn't for others, it wouldn't hurt to try it, but it's good not to be discouraged if it doesn't because there are many things out there that will work for you. In my own experience, her program actually helped me in some ways, and made me worse in others.  My entire healing solution was identical to ratobranco's above.  Everything he wrote was eye-for-eye the experience to my success.","author":"Savannah101","replyTo":"All of you","postID":"post_5373274","date":"20100213-00:00:00 -0500","authorID":"/personal_pages/user/1211406"},{"content":"I bought this program about 5 years ago. Honestly, I like it alot and have learned alot from it. It did alot to help me understand my anxiety and decreased my panic attacks ten fold. I do have a few \"buts\". Would I recommend it to someone with GAD? Maybe. Would I to someone with ocd or adhd? Not a chance. With all the materials it comes with I don't think it's that great for those of us that have problems paying attention, like me. I've never been able to work it \"completely\" because I can't stay focused for 4 months. I must caution not to try to do it all at once or skip around cuz it freaked me out real bad (they tell you not too, but I got over excited when I got it). I would also suggest a really cheap way to try it. Get her book \"From Panic To Power\". It has ALOT of the information from the program in it, plus a few other tips. My library carries it, so you could check there or get it cheap off amazon. If that helps you then you could try the program. It's kinda like she's trying to give you do it yourself therapy in a box. I think it's great if you can't see a therapist and/or a psychiatrist, but I think your best bet would be the book, therapy, and medication if neccessary, meds aren't for everyone and I think some dr's are quick to put everyone on a pill and not everyone needs them. There are alot of great books about anxiety on the market that may be just as or more helpful than the program.","author":"hmf099","postID":"post_5373983","date":"20100214-00:00:00 -0500","authorID":"/personal_pages/user/1041243"},{"content":"I am a 54 yo male and I can't say that it has helped me. I do suffer with severe anxiety and chronic depression, which I have been treated for with meds and counseling for many years with little if any positive results. The reason; as I see it, is that these are symtoms (symptoms) of Personality Disorder, Cluster A,C alond with other problems, which I am also diagnosed with. This is where the focus of treatment should be, but I don't think much is being done about it, and I am no help to myself. It's a long dark road and I hope you all get the help you need instead of just being humored as it were, which is often how Ifeel about it.","author":"oldegoat55","replyTo":"All","postID":"post_5498149","date":"20100323-00:00:00 -0400","authorID":"/personal_pages/user/1255767"},{"content":"Regarding the Lucinda Bassett program, I called the toll-free number and was given the hard sell 3 times consecutively to order the program, and simply pay the $14.95 shipping.  (Of course, this would mean giving them my credit card info, and I did NOT want to do that . . . and I didn't think it would end with the $14.95.)  Each time I said no, I just want the free material advertised on the radio, and each time I was given the hard sell again.  When that was done, the woman on the line tried to sell me some kind of nutritional supplement. The sales pitch was a turn-off, to put it bluntly.","author":"Taxidude","replyTo":"All","postID":"post_5513285","date":"20100327-00:00:00 -0400","authorID":"/personal_pages/user/1260875"},{"content":"I just read where Lucinda Bassett teaches New Age. Has anyone heard this or thinks this of her programs. It probably is just someone trying to slam her program. I am not trying to do that but am just curious.","author":"lindalout49","replyTo":"All","postID":"post_5752305","date":"20100603-00:00:00 -0400","authorID":"/personal_pages/user/1335037"},{"content":"I just need someone to listen to me right now. How i love my hubby,my kids and grandkids but that all else in life suck. I don't have any interest in anything, the things i used to enjoy are no fun anymore. I have no motivation, my house is a wreck, won't let anyone inside it is so awful. But do i do something about it no. Hubby does not know how to help me, i have tried 5 different antidepressants, none helped, just the bad side effects of sweating which i do tons more than most people when not on the meds, so that was aweful. Not on any meds now. Am waiting for the arrival of Lucinda Bassetts program. Would like someone to correspond with that has the same problems with depression. I can't share this with my closest friends, when you have not experienced it you can not understand just how life stopping depression is. thanks for listening.","author":"lindalout49","replyTo":"All","postID":"post_5752415","date":"20100603-00:00:00 -0400","authorID":"/personal_pages/user/1335037"},{"content":"DO NOT BUY THIS PROGRAM - RIP OFF!  They make it difficult to return it.  They charge you over $450.00.  Then...they send you some supplements called \"Good Days\" that come monthly in the mail.  They have your Visa so they charge you and when you try to return them they won't because they say they are digestible product which can't be returned.  Someone needs to prosecute this company.  It is a scam and please don't waste your money...it has cost us over $600.00 so far...cancelled toda and now I'm even more depressed and my anxiety is through the roof!!!!  I think their name is appropriate...Midwest Center for Stress and Anxiety!  They cause it by ripping you off.","author":"kate0564","postID":"post_5755827","date":"20100604-00:00:00 -0400","authorID":"/personal_pages/user/1336017"},{"content":"I got the program a few years back.  Never fully committed to it though.  But I will...someday. I really think Lucinda has a good heart and is meant to do this type of work.  She has suffered the same anxiety/depression issues we have.  I liked listening to the tapes & DVD but had a hard time making the time to do the \"homework\" in the workbook.  Just laziness on my part.  I know the program is there in my closet whenever I need it and I do refer back to some tapes.  Just wanted to let others know that I saw the program on Ebay for half price so after I had ordered it, but within the 30 day trial period I called them and mentioned that it was cheaper on Ebay.  They cut the price in half.  I took the deal.  ","author":"Northcoast","postID":"post_5839344","date":"20100625-00:00:00 -0400","authorID":"/personal_pages/user/201339"},{"content":"I have a response","author":"dc19792004","postID":"post_5941154","date":"20100722-00:00:00 -0400","authorID":"/personal_pages/user/1389042"},{"content":"I purchased the program a couple of years a go and I feel it is a scam. I have suffered from anxiety and panic disorder on and off my whole life. When I purchased the program I was at my lowest point and that is what Lusinda takes advantage of to get your money. Here is what I have learned. Anxiety and Panic Disorders are not just in your head. These problems we suffer from are very unfortunate and the worst part is the medical profession really does not seem to know much about them. It saddens me to see frauds like Lusinda pray on good people that are at the end of their rope with an illness they don't seem to be able to control. I finally saught help with a phyciatrist and when I went the Dr. was an Indian guy that could hardly speak english, I said to my self oh great...... This Dr. actually saved my life, He was younger and did a lot of extra research into panic and anxiety. Here is what he explained to me: He said many people who suffer from these illnesses actually have chemical imbalances. He went to explain to me that the brain has a pump that pumps saratonin from one side of the brain to the other. People with anxiety are over stimulated and therefore the pump sends too much saratonin to the other side too fast. At the time I was on xanex from my regular doctor and he demanded I go off of them. I wanted to hit him because they did provide me with some sort of relief. Now keep in mind at this point in time I was close to house ridden having in excess of 10 panic attacks a day and not being able to drive. He suggested I go on Lexapro which is an anti-depresent. Again I was skeptical and agreed. He started me on a low dose which 5mg and then took me up to 10mg. He told me this medicine would take a few months before I started noticing a difference because it would retrain the pump in your brain to pump less amounts of saratonin. He was absolutely right!!! after about 6 months the panic attacks stoped and I was on my way. Lusinda is a crook, if she is so concerned about your illness like she acts on commercials then why does her program cost so much money for some stupid cd's telling you to cope with symptoms to anxiety... I remember in one cd she said there is no lion ready to attack you. Lusinda is the lion ready to attack your wallet!!! I know first hand how bad this can be and I hope this will help someone and if anyone would like more help with this please don't hesitate to email me at ***@**** I would be more than happy to help you with any information that I have had to learn the hard way through many years of misinformation and scam artists like Lusinda. Dan Collins","author":"dc19792004","postID":"post_5941221","date":"20100722-00:00:00 -0400","authorID":"/personal_pages/user/1389042"},{"content":"Sorry, but this is NOT a scam!  Yes, she charges money for it.  Most psychiatrists charge upwards of $120/hour.  Are they supposed to work for free? If the program didn't work for you, I'm TRULY very sorry to hear that.  But not every method will work for every person.  This isn't a quick fix. She doesn't claim that it is! Quite the opposite, in fact!  It is hard work, and some days you will feel awful.  But that is part of recovery.   I went through the program 8 years ago, after the birth of my first child, and I was having multiple daily panic attacks.  I have not had a single panic attack since completing the program.It was NOT easy, and it took time.  But it worked for me.  As I said, it may not work for everyone.  Does that make it a scam?  No.  ","author":"alyzu","postID":"post_6165437","date":"20100921-00:00:00 -0400","authorID":"/personal_pages/user/1452494"},{"content":"I just got the CD set.  I was charged $14.95 SH, fair.  I knew I could not afford the $480 for the set, but I wanted to see what it was all about.  I then realized the amazon and ebay cheaper options.  I have not finished the program, but being a psychology student, I know the pros and cons.  Cognitive Behavior Modification is the key to making ANY life change.  If you can master that, you can do anything.  I can not say at this point if it works, but I have talked to others in my community who loved it.  I CALLED MIDWEST AND THEY OFFERED ME A SIGNIFICANT DISCOUNT!  Try, ask, knock!  I AM VERY PLEASED WITH THE CUSTOMER SERVICE I have received thus far!  I know what I got, I know it's new, I have the warranty, and I did not pay full price.  Anxiety and depression stink.  Give this a try!","author":"Becauseofnotinspiteof","replyTo":"All","postID":"post_6174464","date":"20100923-00:00:00 -0400","authorID":"/personal_pages/user/1455042"},{"content":"There is no \"Midwest Center for Anxiety and Depression\".   This whole program is so misleading.  Makes you think there's an anxiety clinic somehwere... there's not.   I ordered this prgram and did it, as prescribed, from beginning to end.  And I was very committed because I want so desperately to overcome this so I can live again.  It did not work.  Why?  Because there's nothing new in here.  It's common sense \"stuff\" that we all know.  And you can find the same techniques, for a lot cheaper in a $30 workbook called The Anxiety Disorder and Phobia Workbook. Also, if Lucinda's program works so well for overcoming anxiety and depression, why did her husband kill himself?  It/she didn't help him.","author":"chickypoo380","replyTo":"Everyone","postID":"post_6330135","date":"20101107-00:00:00 -0400","authorID":"/personal_pages/user/1499244"},{"content":"we are all here on this site for a reason, our need for help and understanding, so we are ready to do what it takes to help ourselves, no matter which progrma you choose to follow the common thread is changing our thinking, we are wired a certain way, as is ours to bear, whatever method helps us to retrain our brain to focus our awareness and and accept our thoughts as only thoughts might help. I use Ekhardt Tolle and from what i read above for this as well as Claire Weeks the basics are the same. That we grab on to the scary thoughts while the pleasant float away is ours to learn. Whatever you choose, trusting the process is the first step. May you find peace!","author":"DJ873","postID":"post_6331296","date":"20101107-00:00:00 -0400","authorID":"/personal_pages/user/1492418"},{"content":"OK, Everyone can think that this program is a money thing but I ordered the program 10 years ago and it was the best thing that I did for myself.  Keep in mind, it cost money to create these programs and to ship out so Lucinda is not getting to keep the whole $460 a hit. I think some of you are having trust issues so maybe this program won't work for you because you have already made up your mind it won't work.  But it has been proven, Yes, you do have to do the work. No one is going to do it for you and that's with any therapy. This is the best therapy that I ever came across and I thank Lucinda for creating it.  I have gotten past so many issues and I find myself traveling and pursing so many ventures!  My suggestion: Approach this with an open mind.  You would be surprised what it could do for you!!","author":"NatashaRochel","replyTo":"All","postID":"post_6348671","date":"20101112-00:00:00 -0500","authorID":"/personal_pages/user/1504686"},{"content":"Good luck on getting a return address to send it back to. I also ordered the \"free\" CD and I got the whole program and now after spending 2 hours on the phone with some really hateful people I still cant find out where to send it back to. They are telling me I have to keep it and they are going to keep charging me for it {when thats not what I ordered}. I have to send it back becouse my boyfriend wont let me keep it, its his money. I dont know what to do. So much for them helping with Anxiety, they have just created more for me.","author":"lisalexi","postID":"post_6808066","date":"20110408-00:00:00 -0400","authorID":"/personal_pages/user/1657614"},{"content":"I suffered from severe generalized anxiety and panic attacks after the death of my father. It all began when I had an episode of depersonalization and ended up in the emergency room. I tried Lexapro which gave me a severe panic attack and thereafter, Zoloft. Within days, I was pretty much nonfunctioning and stopped taking the medication. I thought I was going to die. I began having mysterious body pain and migraines. I cried constantly because I didn't know what was happening to me.  It was the scariest, most horrible thing that I have experienced. No one could help me. All they wanted to do was keep trying more meds. My uncle also suffered from anxiety and purchised the program since he felt that he could not leave his home and was on so many different meds. It worked for him and he allowed me to borrow it. To me, the program was perfect and I could relate to so many of the stories. It made me feel like I wasn't crazy.  Luckily, I didn't have to put out the money for the program but if I had to, I would have paid way more for my sanity. I still have anxiety on occasion but not anywhere near as bad as it was. Also, I do still suffer with depression but I guess I am still grieving and I think that my depression especially around holidays is a trigger for my anxiety. The program, for me, gave me the tools that I didn't have before to get through them. Since finishing the program, I have not had one panic attack. Either way, I know everything will be okay and I couldn't ask for more than that.","author":"NTHOMASSIE","postID":"post_6863312","date":"20110428-00:00:00 -0400","authorID":"/personal_pages/user/1673416"},{"content":"I tried the Lucinda Bassett program 6 years ago i have panic disorder and depression comes and goes. The program really really changed me and i am really thankful that it made me a different person. I even stopped having panic attacks. two months ago they came back, the fear, the worry, the panic, the depression everything! i took the program out and started it again i am starting session 3 this week and i have to tell you that everything i had learned is coming back to me i feel almost normal again even though i was doubting myself wondering if i can do this again n get better. The people that think its a scam i have to tell you that nothing comes cheap now a days. i mean they have to pay salaries for customer service and support people and ofcourse her reaserch and making the cds, books ect. and getting the word out is expensive commercials ect. For those who say it didnt work for them i believe that if you believe in yourself and you believe in the program it will work. i spent 2 years searching for a cure. i spoke to authors of other books and spent hours doing research. What worked for me was the lucinda bassett program and taking herbal supplements like st john wort. even just for 2 weeks to calm you down enough to get started with the program. My advise is never give up hope there is something out there that will work and its not medication. there was one point in my life where i felt so bad that i quit my job and wouldnt leave my house. This year i will be graduating from Univesity of Texas YES, where theres lots of people and noise and classes where you feel tied down and you cant get out of lol. Just dont give up i almost did several times but I'd pick myself back up and kept going not for me but for my kids.","author":"nomercy915","postID":"post_6874570","date":"20110502-00:00:00 -0400","authorID":"/personal_pages/user/1676503"},{"content":"A Soft Hard Sell. My wife asked me to call the 1-800 number and get the free CD.  It was a total sales job from the moment the phone picked up on the other end. I know from experience that cognitive therapy works well for some.  However, what put me off was when I was asked whether I wanted to pay for the program with a Visa or MasterCard.  All I wanted was the informational CD. The soft approach to a hard sell and a hard close left me with a bad taste in my mouth.","author":"simon995","postID":"post_6877616","date":"20110503-00:00:00 -0400","authorID":"/personal_pages/user/1677396"},{"content":"My husband bought the Linden Method which is cheaper - says it is very good. later I downloaded FOR free the audios of the Lucinda Bassett - I figured they have everything out there on the web let's look for a freeby since we cannot afford it. I am not that knowledgeable about the free programs or website where you can download from but I managed to find it. My husband said the Linden Method is very good and he also really liked the Lucina Bassett one. I think I got the free Lucinda Bassett here: http://www.tinydl.com/ - the exact URL said there is an error when I tried right now but try going to website and searching there or just search the web. The Linden Method is more affordable you can FIRST see if you can find it for free on the web! Good Luck!","author":"gina255","replyTo":"Does the Lucinda Bassett program work?","postID":"post_6972235","date":"20110608-00:00:00 -0400","authorID":"/personal_pages/user/1705009"},{"content":"The Attacking anxiety program was literally a lifesaver for me.  I feel that it doesn't work for some, as they want an overnight fix and don't want to work on themselves and take the time and effort.  I had extreme panic attacks, depression since childhood, which later turned into my becoming agoraphobic..................I wouldn't even go out to my mailbox.  I had taken this program 18 years ago and it was the best thing I could have ever done for myself as well as my children.  Medication is an easy way out and only masks the problem......which is yourself.....you are the cause of your anxiety by negative thinking.  This program teaches you the tools neccessary to overcome this emotional disorder.  It will take you approx. 4 months to complete, but is well worth it if you want a better life!!!","author":"acb64","postID":"post_7010124","date":"20110622-00:00:00 -0400","authorID":"/personal_pages/user/1715904"},{"content":"The Attacking anxiety program was literally a lifesaver for me.  I feel that it doesn't work for some, as they want an overnight fix and don't want to work on themselves and take the time and effort.  I had extreme panic attacks, depression since childhood, which later turned into my becoming agoraphobic..................I wouldn't even go out to my mailbox.  I had taken this program 18 years ago and it was the best thing I could have ever done for myself as well as my children.  Medication is an easy way out and only masks the problem......which is yourself.....you are the cause of your anxiety by negative thinking.  This program teaches you the tools neccessary to overcome this emotional disorder.  It will take you approx. 4 months to complete, but is well worth it if you want a better life!!!","author":"acb64","postID":"post_7010125","date":"20110622-00:00:00 -0400","authorID":"/personal_pages/user/1715904"},{"content":"They pressured me like crazy to buy the product when I called, even though I didn't have the money. I just wanted the free tape they were offering, to see if it was what I wanted to try. I had to finally tell the salesman that going into debt to buy the program would cause me anxiety. It was like he was trying to tell guilt me into buying it. The fact that the price is so hard to get at makes it seem shady. Plus, if Lucinda made that deal with God she would help people if He helped her, why is she making so much money from it? I read her book which basically said to get over it. Okay! Lol","author":"Nicc7","postID":"post_7113227","date":"20110801-00:00:00 -0400","authorID":"/personal_pages/user/1752837"},{"content":"I did do the attacking anxiety program and let me tell you it helped me SO MUCH!!!  I cannot even begin to express to you how much this program helped me!  I was completely debilitated by anxiety...so much so that I had a hard time leaving the house.  I had all sorts of 'rational' and irrational fears.  I was completely paralyzed by my anxiety, and I actually had no idea what was wrong with me, which made the anxiety even worse.  I was super skeptical about the program, but my anxiety was so bad I was willing to try anything!  Within the first week of purchasing the program I no longer had anxiety attacks!  I felt a complete sense of relief, there was actually something, or someone, out there who could help me!!  After I completed the program I had so much more confidence in myself.  I was able to do things with freedom, and without the constant struggle and worry that comes with anxiety.  Obviously, I highly recommend this program!  I am completely off of all anxiety medication, and I have a completely different outlook on life.  I actually enjoy my life now (I know, I sound like a commercial!).  I still get anxious at times, but nothing like I did before, and the neat thing about the program is you always have it for future reference.  Also, if you don't like it, or it's not working for you, they will give you your money back!    ","author":"erinc711","postID":"post_7146181","date":"20110812-00:00:00 -0400","authorID":"/personal_pages/user/1761917"},{"content":"I myself called the 1-800 number to get the \"Free\" CD - to learn more about the program and all that jazz. I felt like the person I was talking to was understanding and very nice ... until she asked for my Credit Card, at which point I said I wasn't purchasing anything at the moment I just wanted to get more information. This is after she asks all kinds of personal questions. Her attitude changed completely, she couldn't get off the phone fast enough with me - knowing she wasn't getting my credit card number. Her departing comment was \"you need to not worry about the cost of the program and just get it because in six months from now, you'll be worse\" Nice...","author":"hiddenjewel","postID":"post_7191401","date":"20110828-00:00:00 -0400","authorID":"/personal_pages/user/1779835"},{"content":"I bought it n used it n i think it cost too much not worth the price n i still have anxiety.They said u can return it within the 30 days.Their lying they wont let u.  ","author":"girlwithhope","postID":"post_7193064","date":"20110829-00:00:00 -0400","authorID":"/personal_pages/user/1060093"},{"content":"I am a 55 year old businessman as well as being a martial arts master with 40 years experience and a couple of world titles. I meditate and thought I had complete control over my body. I am in excellent shape, yet I was having trouble catching my breath. I did not realize I was suffering from anxiety because a client was stringing me out on $1.6M they owed me. Not getting paid would have ruined my business, credit, I would have lost my home. etc.. Still I did not know my problem was anxiety. I was up late trying to breath walking around my beautiful home when I turned the TV on and watched her infomercial. I ordered the program and used it to heal myself, even before I was eventually paid. It worked for me.","author":"famous1","replyTo":"Everyone","postID":"post_7220165","date":"20110907-00:00:00 -0400","authorID":"/personal_pages/user/1794013"},{"content":"I want to suggest one thing that has helped me. Yes, I purchased the Bassett program many years ago, and I don't have anything bad to say about it. But, sometimes, it's not all in your attitude and how you think about things. Sometimes, there is a physical, chemical component to it as well. With this understanding, I began BHRT (bio-identical hormone replacement therapy) a couple years back, at the age of 52. There are some things that you might discover in the initial evaluation that might blow your mind. For one, they check pretty much everything in the initial blood/saliva analysis. My doctor told me that I had one of the lowest vitamin D3 counts he had ever seen. So, he put me on that supplement. Read up on it, and you'll see  how it can relate to depression and anxiety. My testosterone levels were \"normal\", as my family physician always told me, but what he didn't tell me is that \"normal\" covers such a large range, that telling me it's \"normal\" meant nothing. So, my BHRT doctor boosted my levels up substantially. Just those two things alone helped incredibly. The thing I liked about doing this is that now I know EXACTLY which vitamins and minerals I need, rather than buying and taking a load of supplements, hoping I get what I need. Yes, this costs a bit, but it's worth it. Check it out, and, if nothing has worked for you so far, this might be the ticket. Ron","author":"rdgflex","postID":"post_7332239","date":"20111017-00:00:00 -0400","authorID":"/personal_pages/user/1844731"},{"content":"Psychiatrists cost money also, and the extent to which any counseling helps depends on factors such as the fit between counselor and those being counseled, the desire to do the necessary work, and whether a particular approach works well for a particular person. Unfortunately, it is not an exact science, no matter the approach. One really does have to find out what works for that person, and keep on trying. I think that this program is helpful for me, but it does not necessarily replace other therapy, it depends what one needs. For the cost, it is less than what I was paying for 10 therapy sessions, and I was getting a reasonably low price. I am completing a Master's degree in counseling psychology, so I am not by any means against one on one therapy. There is much value in talking to someone regularly who can personalize counseling to one's individual needs and preferences. Programs such as this one can help also. It's another tool to use. What \"works\" is not the same for everyone. That's why there so many approaches to therapy out there. The important thing is to keep trying, keep working toward greater inner health and development, just as we need to keep at it to keep our physical bodies healthy.","author":"PF1317","replyTo":"All","postID":"post_7586838","date":"20120113-00:00:00 -0500","authorID":"/personal_pages/user/1984665"},{"content":"This program WORKS! I am bi-polar , manic depressive and I have extreme anxiety. I went from job to job to job to job. Never happy, always complaining, moody and anti-social. I am off all bi-polar medicines and have been for almost 4years. The new people I meet don't even know I am bi-polar and my family says being diagnosed  bi-polar was a wrong diagnosis!! It all changed for me taking those Good Days! I have a real career now and not just a job. I have so many friends and actually leave the house. I am on boards and everything. No, I am not cured. I still have some anxiety and depression,but no where near as bad and so less often. My mood is also very stable and I am always optimistic. I have NEVER been optimistic! Thank you Lucinda Bassett for making a natural product that changed my life!!","author":"Ftt","replyTo":"/personal_pages/user/680291","postID":"post_7727749","date":"20120229-00:00:00 -0500","authorID":"/personal_pages/user/2055772"},{"content":"I actually used the program before. My mom basically threw it on my bed and said \"I'm done after this\". I tried it, and even though the information wasn't the best I could get, it was the best for me at that time. I was in severe denial about how or if I was getting abused and having major depression and severe anxiety on top of that was not what I needed. So when your mom tells you that she should have had you aborted blah blah blah, you can imagine how scared I was when I KNEW that I had to move out. But I did, and I have most of that strength because of tools from the program and my now husband. Without it I know I would have been dead. But here I am. 23, happily married for 3 years and now focusing on trying for a child.  I have the program if you would like to buy it. I know its expensive but if you would like, I would sell it for 150. I unfortunately don't think the program is cheap enough. So I believe that is really the only catch especially if you have depression/anxiety. Email me @ ***@**** if you have anymore personal questions about it. I just don't want to write a book on here. :-) Good luck.","author":"chameleoneyes","replyTo":"Whom ever needs it.","postID":"post_7841511","date":"20120408-00:00:00 -0400","authorID":"/personal_pages/user/2105779"},{"content":"I found the program to be very helpful in relieving my anxiety, panic attacks and agoraphobia. With that said, I think learning that I wasn't alone in this arena, learning meditation and visualization and getting off all the medications that I'd tried was a big factor in my recovery. My belief is that a combination of cognitive therapy, support group, meditation and yoga were all a part of the process of regaining myself. With that said, meditation and visualization are like any other physical exercise. To reap benefits, you must practice the \"exercises\" regularly. It takes a bit of time for most people to be able to do this. It is not a magic bullet or cure all but really teaches you the coping skills to manage anxiety and panic attacks. It's been 14 years since my last full blown panic attack. Not to say I don't have moments of anxiety but I know now how to effectively deal with it and cut it off before it gets out of control. Most importantly, everyone should be checked out medically to be sure there isn't a physical cause of the symptoms such as thyroid imbalance and other things before assuming it's just nerves. Once you feel comfortable with that learn how to find  your \"happy place\" to get you back on track. Life is way too short to live it in a state of perpetual anxiety.","author":"plrad","postID":"post_7847550","date":"20120410-00:00:00 -0400","authorID":"/personal_pages/user/2108598"},{"content":"Anxiety and depression is definitely a daily struggle, it takes more then one type of approach, as it takes a toll on us mentally, emotionally and physically. Best way to deal is one day at a time. I  added the lucinda bassett program into my routine about 2 yrs ago and i think its worth it. I have been trying to couple it with with a healthier lifestyle thru excercise to burn the stress and anxiety, eating healthier, Self improvement through meditation and yoga are all vital in healing process. Some days easier then others, its debilitating especially when u constantly feel u are being tried by people, life, regrets, demons...etc etc.! For me its a genetic condition, mom and sis struggle. my anxiety extended from growing up in a negative environment. No one has a perfect life, it isnt usually everything we hoped it would bee! nevertheless, we can change it, doesnt matter who u are. The lucinda bassett program teaches you how to reform your thought process but not by way of hypnosis, through discussions and excercises it helps you rebuild a positive outlook and thought process so that you no longer  beat  yourself down everyday. It gives you the tools to overcome certain fears related to anxiety. Basically the Power of positive thinking, there is a little more to it But you have to be committed to the journey and making the improvement like it was mentioned above it needs to be done by you. U need to decide that you are done with the turmoil,  this condition will not continue to controll your life. Decide that you want to be happy, know that you can change simply because you want to and Commit yourself to nothing but dreaming up the life you want, who and what you want to be and reinvent yourself. Because thats what all about, no one said it would be easy, the steuggle is meant to make us stronger. Sounds cliche but the mind is a powerful thing!. Definitely helps to talk with others, everyone here, is here to help! God bless","author":"Deeply_Disturbed","replyTo":"Ryn21","postID":"post_7850333","date":"20120411-00:00:00 -0400","authorID":"/personal_pages/user/2012852"},{"content":"Hi, folks, I found this forum after watching Lucinda Bassett's commercial on TV recently. I'm surprised to learn that her program costs $500 or more. Geez....I have been suffering from anxiety and depression since for some time. I have been on and off Zoloft for five years. I find that Zoloft helps me a little, yet I still have an anxiety attack or I go into a depression phase from time to time. But here's what helped me get through those tough times....it saved my depressive friend's life (he was going to kill himself). Repeat this to yourself, copy this to a piece of paper and post it on your wall so you look at it and remember whenever you're in a blue mood or feeling jittery: You are not your thoughts. You are not your fears. You are not your worries. You are not your past personal issues. Whatever negatives that you have, let them go. Observe them like clouds in the sky, let them pass. Be the earth, think of life that you give to the trees, the water that nurture the grass, the plants and the creatures on the surface. All the squiggly worms that crawl under the ground, venomous snakes that slide around on the grass and ugly bugs (potato bugs especially) will be bird food. That is part of nature. You have nothing to fear. You are going to turn out fine, I know. Turn around and let the sun shine on your face. :D God bless y'all.","author":"DMSD12","postID":"post_7947992","date":"20120513-00:00:00 -0400","authorID":"/personal_pages/user/2161100"},{"content":"If you go by the people who responded yoyou'll see that thoughs who have tried it found it helped and they who have not tried it just guess what it's all about. Figuring price and why he can't find it. Well I'm in my forties and have had anxiety and panic attacks so bad I had physical pain, dizziness, panic attacks anywhere from 5-10 times a day. I was just waiting to die. It's what I thought. It's helped me completely. It does take 8 weeks to co.pletebut it's worth every penny. This is for whoever cones to this web site after me.","author":"WillyBanger","replyTo":"/personal_pages/user/97676","postID":"post_8180311","date":"20120726-00:00:00 -0400","authorID":"/personal_pages/user/3153166"},{"content":"Let me tell you..this program changed my life. I started having panic attacks when i was 18 and i am now 34. At first i didnt know what the hell was happening to me. I thought i was going to die or lose my mind. Doctors ran tests after tests and eventually i just gave up..couldnt drive..couldnt go to stores or anything. I was slowly fading away and was forced to move back in with my mother who thought i was crazy along with everyone else. I was laying in the bed pne night with my mom because uh yea i could no longer sleep alone either. An infomercial came on and in my sleep i kept hearing these symptoms that i had..so i opened my eyes and woke up my mother. I said, mom this is it! This is what i am goubg through! At this point she was so worried that she was willing to do anything. My bday was a few days away and she offered to get this as my gift. I checked the mail everyday anticipating its arrival. I got it..opened it..it was so easy to follow. Videos to looj at..cassettes to listen to..literature to read was all i had to do. It was so easy. Literally, in a week, i was drivibg again..hanging with my friends..going to stores ALONE! I was so grateful and felt so blessed that God woke me up that night. It completely changed my life.. i didnt even finish everything in the program andmypanic attacks vanished...now years later i am still free from the monsters that haunted me for ayear straight. I highly recommend this. Im not going to say that you will never have anxiety again. Anxiety is a normal part of living. Its gonna happen..no one is anxiety free..especially with the way this world is now..but if you want your life back do it today! Dont let a few negative comment detoyr you from a healthy and wonderful life. I am married now with two children and a step daughter and i couldnt b happier. I am my city's top hair stylist..life is great and whomever is responsible for creating this life changing system deserves all of the blessings and love that their hearts can hold. My sister n law suffers from panic attacks and i look forward to giving her this as a gift..i know that it will bring us closer and change her life as well. Im sorry that this post was so long but this is the first time that i was able to share this life changing experience with people who share the same disorder...try it with your heart and soul and know that it will work! God bless you all and i will keep you all in my prayers! Good luck!","author":"kiysha","replyTo":"A miracle from God!","postID":"post_8188836","date":"20120729-00:00:00 -0400","authorID":"/personal_pages/user/3159122"},{"content":"Please do you honestly think that these people have not tried telling themselves all of this. That doesnt work...it takes alot more than that. Giving yourself a pep talk is not gonna cut it. May have worked for you but thts maybr 1 n 5.  Tge program teaches yiy to strengthen your mind your mind..physically and mentally..its worth the money. When i purchased it it was over ten years ago so it was a little cheaper but they break the payments up. And remember any price us negotiable..some money is better than no money.","author":"kiysha","replyTo":"/personal_pages/user/2161100","postID":"post_8188868","date":"20120730-00:00:00 -0400","authorID":"/personal_pages/user/3159122"},{"content":"I love Lucinda, she has helped me a lot. Her program has really changed me. I thank God for this program. Now, the money aspect, That is a bit expensive but with a Google search anything is possible. I don't think everyone is evil and out to get us.","author":"TheHendy","replyTo":"Everyone","postID":"post_8308272","date":"20120907-00:00:00 -0400","authorID":"/personal_pages/user/3249664"},{"content":"Check with your local social service program to see if there are support groups for military spouses.  If you have a VA office nearby, you should also check to see what services they might know of that could help you.  Do not let your husband talk you out of getting help for yourself.  Sometimes spouses can minimize things and it can have devastating affects.  You have a child now and that will make your stress worse if you don't get help for it.  There is no reason to have to live with panic, stress and worry.  There is help available.  Try support groups and VA services first.  If that doesn't work, then check with the VA to get resources for local behavioral health services in your state.  Also see what kind of mental health care your health insurance has available, as there should be some if it is military coverage.  Good luck!  ","author":"nkiflemar","replyTo":"/personal_pages/user/630911","postID":"post_8313365","date":"20120909-00:00:00 -0400","authorID":"/personal_pages/user/3340978"},{"content":"I can tell you that it did help me.  I went through this program a little more than 10 years ago and it was critically important in helping me to overcome my moderate to high anxiety.  It really did help to change my life.  I did also see a counselor which helped with other issues I had but didn't really do much for the anxiety.  Meds had no impact or made things worse.  Before you go on meds, try this program or go see a counselor.  ","author":"foosqust","postID":"post_8448385","date":"20121023-00:00:00 -0400","authorID":"/personal_pages/user/4205194"},{"content":"This program worked for me and others ( I'm a psychologist). My husband found it in a commercial and thought he was nuts-- to use something from a commercial (I never do) but I tried it. Yes, I am sure he, (Lucinda) makes plenty on this, but that's an ad hominen. She could make money and it could work. The program takes the principles of cognitive therapy and packages them in course format. It worked for me kn a major way. No it didn't work for me. I worked it. As others pointed out no therapy works in general. All research has found the same thing in experiments where treated and nontreated people. 1/3 of the people get better. 1/3 bet worse and 1/3 stay the same. No program , except for, perhaps certain brainwashing techniques works unless   - a person believes that it will work, commits to doing it, spends time (sometimes A LOT, suspends disbelief and wants to change attitudes and belief. This program and others like is CAN work. Desperation is a good motivator what alcoholics anonymous calls hitting bottom. A support group helps. An off-site say, once a week can help. It's no magic pill, but it can work. It's easy to call something  a scam. My advice, (I do realize nobody asked for it :-), is if you have problems give it a real try. There's a 30 day money back guarantee ( I had intended to return it, myself) so it doesn't cost anything to try. My 2 cents )or is it 2 dollars these days. Inflation you know.","author":"Dr_Shrink","replyTo":"Lucinda Basset Program","postID":"post_8457087","date":"20121026-00:00:00 -0400","authorID":"/personal_pages/user/4220925"},{"content":"I used the Lucinda Basset 15-week program that I checked out from the library!  I kept renewing it.  I faithfully listened over and over again to the tapes each week  and did all the workbook exercises.  Afterwards, I was totally able to control my panic and anxiety.  I have not had another big attack because I know how to stop it.  My therapist said that she was about to admit me to a mental institution when I started the program, so she didn't have to.  I have recommended it to many people since then.  I recommend the program, not the books alone.  I had to LISTEN, not read, how to learn the techniques.","author":"Cechud","replyTo":"health forum","postID":"post_8499608","date":"20121108-00:00:00 -0500","authorID":"/personal_pages/user/4298807"},{"content":"I didn't have time to read many of these posts but enough to see that some people call the program a scam.  Obviously no method works for everyone, but that doesn't make it a scam.  I suffered from mild to moderate depression from the time I was a teenager, if not earlier - though I didn't understand what it was.  I was finally diagnosed with clinical depression about 15 years ago and began taking meds for it.  Meanwhile I had been in therapy on and off for many of my teen years and adult years.  I can only guess that I (or insurance) paid thousands and thousands of dollars for meds and various therapists with no significant improvement.  About 7 years ago I decided to wean myself off of the antidepressants because I felt they changed me as a person.  I soon became so depressed that I wanted to die, but I didn't want to go back on them.  (NOTE:  I do NOT recommend discontinuing your meds!)  But I was very lucky and discovered Lucinda Bassett's program and ordered it out of desperation.  They made a payment plan for me that I could afford.  Much to my amazement the program began to help almost immediately.  After a short time of listening to the CD's, my life began to change.  I used the program for about 6-8 months and have not dealt with depression since.  I still have the program and have debated about selling it online but I worry that I may need it again someday.  In any case, the program cost me far less than what I paid for years of medication and therapy.  Perhaps I should call THOSE methods scams.  I don't care what people say.  It worked for me and I'll always be grateful.","author":"Suzanne_W","replyTo":"Lucinda Bassett Program","postID":"post_8510537","date":"20121112-00:00:00 -0500","authorID":"/personal_pages/user/4318942"},{"content":"I ordered the program for a loved one.  Since I didn't use it myself I can't say if I think it's a good program or not.  Truly, we were at a point where I would have paid large sums of money to help this person, so if it's been helpful (and I can't really say yet), it was worth the money. What I am very upset about is the disingenuous \"free\" vitamin supplements that came with the program.  I wasn't interested in them, but since they said it was free, I just tossed them.  Then I saw some \"lab\" bills on my credit card statement.  At first, since I have a child with a chronic illness who frequently has lab work, I didn't really look at it closely.  Then, when another box (which still said \"free\" by the way) came in the mail, I called to tell them that I do NOT want these.   They'd charged me over $87 for something that they touted as \"free\".  I offered to fax them a copy of the packing list that came with the supplements that said \"free trial\" and they said, \"No, you don't need to do that.  We know it says free, but it's not really free.\" When I asked to talk with the corporate office to complain, they said that that would be impossible.  They claimed that they don't even have a phone number, that they can only contact them via email. There's a reason this company scores a D- with the Better Business Bureau.","author":"eileen728","replyTo":"Lucinda Bassett Program","postID":"post_8537932","date":"20121121-00:00:00 -0500","authorID":"/personal_pages/user/4367512"},{"content":"I believe it is worth a try. my husband is a Iraqi veteran and his anxiety has gotten worse in the past year, he doesn't want to be dependent on medications but programs that help with lifestyle changes and anxiety attacks we've tried and gotten consultations for are thousands of dollars for weeks to a month of treatment. that was something that insurance wouldn't cover and they wanted in full before treatments. Believe me, as much as we've been through and been asked to pay, $400 is a huge deal because mental help facilities are not anywhere close to that cheap. It sounds like a lot but its really not. Everything works differently for every person. Just because it doesnt work for some doesnt mean its a scam.","author":"kbg07","postID":"post_8561829","date":"20121128-00:00:00 -0500","authorID":"/personal_pages/user/4408729"},{"content":"I agree with you kbg07.  I have been suffering with panic attacks since my late teens.  Since my father died 12 years ago, they've increased and were crippling for awhile.  Now, I suffer with a mild form of agoraphobia.  I'm able to leave my house, but I'm afraid to travel too far from home and would to travel so badly.  I feel like I can't leave a certain mile radius I called my geographical safety or comfort zone.  After years of therapy, partial hospitalization, drinking, medication and just plain old discouragement and depression, I feel like I have nothing to lose in paying for this program.  I need something to help me b/c therapy, psychiatrist and medication have sent me one step forward and 5 steps backwards.  I am so tired of being afraid to travel and being afraid of large social scenes that I am willing to try this programs.  When your life has been so negatively impacted by panic attacks and anxiety disorders and agoraphobia, you are willing to try anything and I pray to God that this program does help me.","author":"relief74","replyTo":"/personal_pages/user/4408729","postID":"post_8565879","date":"20121129-00:00:00 -0500","authorID":"/personal_pages/user/4414168"},{"content":"People aren't calling the program a scam because of its effectiveness.  People aren't saying that $500.00 is too much for a cure.  What people are saying is that they are promised a free CD and they get a hard sell and asked for a credit card number.  If they give a credit card number, they get charged for the program that they haven't ordered and have a hard time returning it.  That's the scam.  It's about targeting a group of people with low self esteem who think of themselves as victims and victimizing them ... victimizing the people that need help and come for help.  Legitimate products need to be sold in legitimate ways.  The ends don't justify the means.","author":"DavidHayes1956","postID":"post_8575137","date":"20121202-00:00:00 -0500","authorID":"/personal_pages/user/4427628"},{"content":"Have you all noticed that those who say the program is great are usually long replies, and sound like they were by professional writers, and in my opinion, they are from the program sellers. You don't need all this crap. Just get in a room like your bedroom, lie down and turn down the lights and relax with heavy breathing techniques and then put everything out of your mind and say to yourself over and over something like this: \"I am not afraid of anything or anybody.\" Do this 50 times. Then two days later, repeat this exercise. Do not let anything interupt you as you continue to say those words and listen to them as you say them. You will find your anxiety problems leaving. After that, every week or so at night before you go to sleep, do the same thing. Repeat that phrase for about three minutes over and over again. It will work and it cost you nothing. You have trained your brain to heal itself; it is that simple. If it takes longer to get relief, spend more time telling your subconcious mind that you are not afraid of anything or anybody. It works!","author":"Fla_Man","replyTo":"/personal_pages/user/4427628","postID":"post_8576478","date":"20121202-00:00:00 -0500","authorID":"/personal_pages/user/4430097"},{"content":"I tried this program and found it to be helpful about 20 years ago...I am looking to get a glimse of the program again...I want my life to be settled and I know if I take time to think about the techniques in this program I will be able to come to grips with all of the negative thoughts I have...It is structured and giving the repetition of the way to handle lifes adversities based on whats real, not on how I was taught. If I learn to redirect and find continuous support in what right now is overwhelming me, I know will turn around to make life a lot more enjoyable...thanks Lucinda I am ready for the life I always wanted...","author":"break4me","replyTo":"/personal_pages/user/1124206","postID":"post_8600109","date":"20121208-00:00:00 -0500","authorID":"/personal_pages/user/4465246"},{"content":"very useful information...you seem to have a very good library of information and I think a lot of people could really learn a lot by what you are saying...thanks for the input it helped me decide to get this and I believe it will be just what Ive been looking for to help get me in a good direction where I go after that is up to me...","author":"break4me","replyTo":"/personal_pages/user/1041243","postID":"post_8600187","date":"20121208-00:00:00 -0500","authorID":"/personal_pages/user/4465246"},{"content":"I see a lot of put downs for a great program here. The Attacking anxiety and Depression program does in fact work IF you use it. Most people like a quick fix and if that is you then it will NOT work. It's that simple. The high cost is another thing I see complaints about. Think of it this way. How much is your mental health worth or having your life back worth??? Cognitive behavioral therapy is how this program works. Read up on what that is. It actually works if you use the program as it is put together. The free CD will not fix you. THE program can help but you will fix you the program will guide you so let it. It is a self help program. you will help your self in the comfort of your own home.","author":"AZoutlaw","postID":"post_8632308","date":"20121217-00:00:00 -0500","authorID":"/personal_pages/user/4519289"},{"content":"I totally agree with you. I was in a similar situation as you, and I feel the program saved my life.  I followed it, step by step, CDs, workbook, everything.  I now feel 100% better. If I ever feel the anxiety coming on, I now know how to handle it and make it go away, right away.  This program was a Godsend to me!","author":"nohow418","replyTo":"/personal_pages/user/4318942","postID":"post_8818751","date":"20130205-00:00:00 -0500","authorID":"/personal_pages/user/4858261"},{"content":"I hope I can put some of the negative comments about Lucinda and her program to rest.  Hopefully I can make this short and sweet...I may not be able to ;) In the early 90's, I like to call it my Peak at anxiety/depression  it took me years to get there and it finally came to a head!  I couldn't leave my house, I had attacks most of the day...I was in living hell.  I started with a therapist..psychologist...did the whole medical thing... .wasn't going very far.  Was on meds....Saw Lucinda's info-mmercial on tv and cried and said to myself \"I'm not alone!\"  I had the tapes sent fedex.  I was on 20 mil. of Valium when I started. I read some of the post where people were commenting that you do the work...well duh...YES YOU DO THE WORK...it's a mental disability!!   But I am here to tell you if it wasn't for her program I would never be where I am today!  She gave me the tools, the knowledge that I needed to educate myself and be whole again!!  It works!!  My doctor at the time listened to the 1st three tapes when i told her I quit therapy...she now refers her patience to the program and would have some of them call me to talk about my experience.  She said that most patients take years and years to get through this....I got through it in 9 months where I could at least function...it took a bit more of time to feel really whole again....Now it is 2013, I am whole and have been for many years.  Do I apply what I learned...probably...just so use to doing it that at times I don't realize I'm even doing it...but when I do have a set-back I know how to stop it immediately.  This program is amazing and will give you your life back.  The money for the tapes were a struggle...but at what cost would it have been for me if I didn't do it?  What is your state of mind worth to you.  How important is it to you to be able to walk out your door, drive, sit in the theater, go out to dinner, go to the market...I would pay triple of what I paid!!  I'm not sure what her program cost today....in 1990 they were close to $400.00...which was a lot back then for us....I was already spending $100.00 a week for therapy...I don't know what that cost today either...and because of her I NEVER WILL....It is an amazing program.","author":"cyncyn50","postID":"post_8944219","date":"20130319-00:00:00 -0400","authorID":"/personal_pages/user/5107617"},{"content":"Well I got the program about 5 months ago and I still haven't finished it but I can say that it is helpful, it makes me feel better to know that someone has felt this and gotten past it. I haven't been able to drive since I got my first panic attack while driving. The program will help you if you put 100% in2 it. I can say that it hasn't gotten me out of my anxiety but atleast I know what I have now. Im not gonna say it will work for you bcus it may not but I know a lot of ppl that say it has helped them. After I finish the program I will let you know. Good luck! ps... I think you can look up some of her things on utube.","author":"blued82","postID":"post_8944767","date":"20130319-00:00:00 -0400","authorID":"/personal_pages/user/4929523"},{"content":"What are her credentials - I remember when she used to appear on an afternoon show with Christina Ferrera (another fake) and I believe she was either a cook or consumer advocate.  I would not trust spending my money on anything she endorses","author":"snow_bird1029","postID":"post_8953005","date":"20130321-00:00:00 -0400","authorID":"/personal_pages/user/5122739"},{"content":"Years ago when I was at the end of my rope (before Paxil) I saw her info mercial and was amazed how she used audio and visual elements that were designed to enhance the symptoms of anyone watching.  She used repetitive music/sounds and strange background noises knowing FULL WELLthat people suffering from  extreme anxiety and depression had episodes that were triggered by such media.","author":"hltzi","postID":"post_9126751","date":"20130520-00:00:00 -0400","authorID":"/personal_pages/user/5510550"},{"content":"I have been suffering from severe Anxiety and Depression since 2 years ago. I used zoloft. It was after severe emotional stress that I had. I could not work, sleep, even sit still on a chair. I had racing thoughts and I wanted to run. Now, I am much better. I think the things which helped me were first the medication and then time. Time will heal it. The psychiatrist and psychologist were not helpful in my opinion. They were just good because they could provide medical certificates which I could get off from my work for a couple of months. Being away from work and spending my time with my loved ones was very helpful. I think for a person with anxiety, it will be difficult to change his/her mind. Because, the brain is stopped from working. The only thing that can help is just to provide a place in which he/she feels safe and calm. The worst thing about the depression and anxiety is that the person gets pessimistic about everyone/everything so having someone which you can completely trust and rely on is like a miracle. That is my own experience which worked for me well.","author":"Josef1982","postID":"post_9267325","date":"20130707-00:00:00 -0400","authorID":"/personal_pages/user/5728680"},{"content":"I never saw one of her commercials, but I heard her speaking once on the radio. I can say, she saved my life. I had severe anxiety , and after years of not being able to deal with it, only it getting worse, I developed depression. I went to a specialest who instead of finding out if there was a root cause wanted to throw a bunch of meds at me. I refused. Then one day while with my family ( whom I tried to hide as much as possible from the problem ) I heard her 1 mn. speach and memerized the phone number. I odrered the system the very next day and that was over 10 years ago. i have learned to deal with my anxiety, my depression is gone, Relaxation learning triggers and how to deal with the problems. Maybe it doesnt help for everyone, but for everyone that it does help we are blessed and happy to share the news. God Bless lucinda basset!","author":"Wilder1","replyTo":"/personal_pages/user/5510550","postID":"post_9385237","date":"20130813-00:00:00 -0400","authorID":"/personal_pages/user/5904418"},{"content":"I used it and it did work, wonderfuly. the dr. only wanted to put me on meds, the specialest said I would only get worse if I didnt take the meds. guess what i am lovin life and doing great. my mom used it as well and guess what, it works! So what if she is making money from it????? she found a need and filled it, you do the math. I applaud her and wish her well. Anxiety is a theif and will rob you of your life, as well as depression. what works for some doesnt for others..I have learned to relax, breathe, enjoy. I take walks, i get busy. i dont over analize everything. do I still have anxiety, of courses we all do. But the difference is I have learned how to deal with it and with that knowledge comes power to over come. I also take vitimins, but that didnt come about till after i had gone through her course. Is it worth the money? Every penny. I would pay double for it because it works and gave me hope. that was over 10 years ago and my life is better now then it was then by a long shot!!","author":"Wilder1","replyTo":"/personal_pages/user/366811","postID":"post_9385272","date":"20130813-00:00:00 -0400","authorID":"/personal_pages/user/5904418"},{"content":"JSG....RIGHT ON!!! I so appreciate your comments regarding Lucinda Bassett. I'm not just saying that because I'm in the \"helping\" industry working with individuals, but because what you said regarding an individuals healing, change & transformation is done by THEIR own mind. I am simply the facilitator of their wonderful tool.....their mind.","author":"averderame","replyTo":"/personal_pages/user/366811","postID":"post_9427543","date":"20130827-00:00:00 -0400","authorID":"/personal_pages/user/5972340"},{"content":"Roger, I don't know if you will receive this message but I just saw your post and want you to know that you are in my prayers!  It is 2013 now (5 years since your post) but I hope you are well and learning how to cope with this dreaded depression!  Peace be with you!  - Jo","author":"jo595","replyTo":"/personal_pages/user/718097","postID":"post_9436104","date":"20130829-00:00:00 -0400","authorID":"/personal_pages/user/5984931"},{"content":"Of course it's a money thing, so is a psychiatrist and medicine and the car you drive. Don't let that dissuade you, it's great honest, factual information. Information, once applied is a powerful tool against anxiety. It's a good system of recovery and works if you put in the work as others have said.","author":"harpoonmaster","postID":"post_9521278","date":"20130928-00:00:00 -0400","authorID":"/personal_pages/user/6327978"},{"content":"It's a scam and the program doesn't work. She has a BS return policy and scam artists working for her. Don't buy it...shes getting rich by preying on the weak.","author":"scubadmc","postID":"post_9527570","date":"20130930-00:00:00 -0400","authorID":"/personal_pages/user/6352255"},{"content":"In the 80s I read an advertisement for a free seminar for anyone suffering from anxiety. I arrived to find a smallish room crammed with people, all eyeing the door. It turns out that it was one of Lucinda Bassett's first forays to expand beyond her home state of Ohio (this was in Louisville). I went through the group meetings and came to know Lucinda, but more so her sister, Donna. They invited me to co-facillitate the upcoming six-week program, which I did, under the guidance of a licensed psychologist. It's important to remember that in those days, folks with all types of anxiety disorders were rather novel in that psychology had not dealt with this issue very frequently. I had personally been to any number of doctors, looking for either a physiological or psychological cure - to no avail. At one point I was put on Prozac and on the fifth day was eyeing a butcher knife, wondering how it would feel to run it down my arm (I was NOT suicidal up to this point.) A call to my psychiatrist returned, \"Oh, you're just having another panic attack. Double the dose.\"  I would never have survived had my husband not thrown the bottle into the garbage. A year later, a patient of the same doctor who was on Prozac for depression took an automatic rifle to his workplace and killed or injured a dozen people. A second physican prescribed the beginning of what turned out to be a 17-year nightmare of addiction to Ativan. (The manufacturer withheld notation of its addictive quality and thus became the focus of the largest class action lawsuit in Britain's history when it surfaced.) It is harder to kick than heroin and the only help doctors could give was to substitute it with another drug, equally addictive. Thus, I had to wean myself in micro-levels or risk possible deadly consequences. I am now completely drug free. Many people do not realize that once you begin benzodiazepines or some of the other class drugs, no private insurance company will cover you. They believe the cost of attempted suicides to be prohibitive, even if you are not suicidal.  It is a very misunderstood condition. Sadly, Donna was diagnosed with lukemia shortly thereafter and passed away, leaving her daughter, whom, Lucinda told me in a phone conversation, she was helping to raise. There were many in the groups who were vastly helped by the program. I had been suffering from panic attacks already for 20 years at that point. While the program definitely helped, it actually was being undermined by an abusive marriage I could not leave at that time - thus the program's efficacy was not fairly tested.  Lucinda developed her program based on her own formula for recovery - and I don't believe she ever represents anything to the contrary. There have been thousands of people helped by the program, but it takes dedication and a desire to get better. Many of the comments I'm reading here indicate that these folks have a negative attitude and therefore likely could not benefit from its concepts. I do chide them by saying that it isn't fair to condemn something that works for so many, simply because it does not work for you. The expense of Lucinda's program I believe is in part due to two things:  1) the original program was on cassette tape - about 20 cassettes - and the mere packaging was expensive. 2) As the program grew beyond what she could produce privately, she put fulfillment into the hands of a professional company and they likely added a healthy commission for themselves. They are professional marketers and their technique is hard sell and reluctance to take returns. This is typical - I just went through the same arrangement with the folks at Keronique. Naturally many of the people who suffer from severe anxiety are unable to work and this cost is considerable for them. About four years ago I ordered the program again on DVD and have converted them to my iTunes so they can travel with me. I'm revisiting them now and find them exceedingly informative - her techniques having been refined by decades of successful clients. I can only underscore \"decades\" - and point out that obviously she is helping people or she would not have survived this long. If you are sincere about introspection and the desire to change your attitude so that anxiety does not underscore your every thought - then this program will work for you.  If it works, then it is well, well worth the cost. What is getting your life back worth?","author":"KimDD","replyTo":"/personal_pages/user/6352255","postID":"post_9574921","date":"20131016-00:00:00 -0400","authorID":"/personal_pages/user/6509622"},{"content":"This thread is very old, if you have something to ask or share, it would be far better to start your own new thread, as the old ones get passed up by most readers/posters. Thanks! http://www.medhelp.org/posts/new_with_new_subject?forum_id=71","author":"nursegirl6572","replyTo":"ALL","postID":"post_9575267","date":"20131016-00:00:00 -0400","authorID":"/personal_pages/user/480448"},{"content":"1 out of 10 people suffer from panic attacks. I had them from age 16 to 40. One night as I was suffering, I saw an infomercial about Lucinda's program and decided to spend the $300 to try the program. At first the tapes actually brought on more anxiety but over time, they were fantastic! It seriously changed my life! I have loaned out my tapes to over 50 people over the years and they have drastically helped everyone who has used them! From teens to older people, these tapes provide the means to learn how to flip the switch from panic to power!","author":"TrudyKeuch","postID":"post_10031246","date":"20140302-00:00:00 -0500","authorID":"/personal_pages/user/7740704"},{"content":"Yes Yes Yes the programs works.   I couldn't leave home at all.  I was afraid of everything.  The doctor tried to put me on pills and when I asked \" will this cure me or when I am off will the anxiety come back?\" he said \"if you get off the meds the symptoms will continue.\" I told myself heck no will I have a life where I am constantly on meds.  I was lost and didn't know what to do.  Thanks GOD I could not sleep and I saw Lucinda's commercial.  Right away I ordered I thought to myself \"what do I have to lose\" I received the package and I followed her every work and 14 weeks later I was CURED.  Now I have a wife and a 3 year old daughter and we do things all the time.  I have never met her in person but I seriously believe she SAVED MY LIFE.  People are going to get diff results with the programs but I just wanted to post the fact that if you are at the I have nothing to lose stage then go for it with an open mind and know THAT YOU CAN DO IT !!! have faith and everything will work out ONE LOVE","author":"dsone","replyTo":"Group","postID":"post_10133446","date":"20140324-00:00:00 -0400","authorID":"/personal_pages/user/7948837"},{"content":"I ordered this.  I've decided to listen to the CDs several times first...I even play them in the middle of the night when I can't sleep.  In the car, on my computer while working...over and over and over.  It is helping because my thoughts are changing and I have talked myself down from several full blown, body on fire, claustrophobic, high energy anxiety attacks.  I have even begun to plan a new company.  I have added herbal supplements to the plan that deal with mood, anxiety and menopause to see if that will help. With no insurance for doctors and meds this is my plan of attack and it is working.  She can be self promoting, but you can also tell from her stories that she has truly suffered herself and the interviews with others really bring home the content.   Try some Anthony Robbins on Youtube and Lilly Gills You Unstuck.  I think personally rewriting the tapes takes time and self-inflicted obsession with getting the **** on with your life is necessary.  I am so over this anxiety ********...time to move on!","author":"ThrZEnough","replyTo":"ALL","postID":"post_10173546","date":"20140331-00:00:00 -0400","authorID":"/personal_pages/user/8026670"},{"content":"Lucinda Bassett sold her company to TransCap Corporation in 2008, so any attacks on how the website is designed or the pricing is unfounded. No doubt she has some sort of deal to remain as a spokesperson for the product as it is identified with her, so she would be a key marketing aspect for it. Her own books as well are a tie-in to her past work. Maybe you should do a little research before you criticize someone so blatantly on a public forum?","author":"George66514","replyTo":"/personal_pages/user/366811","postID":"post_10315419","date":"20140429-00:00:00 -0400","authorID":"/personal_pages/user/8572933"},{"content":"I have to disagree with you. Almost completely. I take vitamins and minerals and Vitamin D every single day. Are you saying anxiety is a deficiency? And lack of faith? Seriously?","author":"Beedozer","replyTo":"/personal_pages/user/531653","postID":"post_10511885","date":"20140604-00:00:00 -0400","authorID":"/personal_pages/user/9130399"},{"content":"I experienced many panic attacks and regular anxiety for several years over ten years ago. I tried many things. I want to get to the point quickly. Try these steps. These were the most helpful behavioral changes I made and they have helped me enormously. (And yes, my situation was very serious) #1  Breath. Whenever you feel that \"wave\" starting to build and come at you: Breath slow and deep for a count of 4 (or whatever count works with your breathing) on an in breath, then breath out for a count of 8. Do this for at least a minute or more. Then #2 speak kindly to yourself. Say things like. \" It is OK. You know what this is. You will get through it. You always have. You are not having a heart attack, or going crazy.\"  Also, I created my own little mantra you are welcome to use....I am happy and healthy and whole and well. Repeat over and over when you feel on edge. #3 Tell everyone that matters that you may at times (not always convenient times) experience panic attacks or anxiety to the point where you may need to leave, or change what you are doing, or just seem a bit out of it. In my life, most everyone was awesome, and it opened doors for me to help others who often said \" Oh my god, you do? I do too.\". I found out a huge number of the people I know have experienced this at some point. #4 You are you not the \"issue\". Try not to own it. You do not \"have\" anxiety. You only experience it. Don't let it control you by making it a part of yourself. #5 Relaxation recordings really can help. I used to have a CD next to my bed for helping me go to sleep at night ( a time when stressful thoughts can take hold). There are now a lot of relaxation recordings on the internet for free. Try a few, see what works for you. #6 Let a panic attack wash over you at least once without fighting it. Just give in to it. Find out that it will not kill you or make you lose your mind. It can be scary and tiring, but the fear of it is where it's greatest power lies. Let the fear out of it like air out of a balloon.                                                                                                           I hope this helps. I have not had more than reasonable anxiety for the past 10 years, even though I have been through untold amounts of challenges. Even when my mother died, my dad had a stroke, my daughter became my son and my physical health suffered some huge setbacks, I still did not go back to that place of overwhelming anxiety.                                                   And, yes, after doctors and some meds (that only made things more complicated), I did use Lucinda's book and tapes, and visited a good therapist, and changed a lot of behaviors (like more care for and time for myself), and upped my walks, and changed my one cup of coffee to one cup of decaf. Try many things, and don't lose hope. Find a friend to talk to. Cry it out ( I had 44 years of held in tears to purge). Good luck.","author":"vespa2223","replyTo":"/personal_pages/user/213375","postID":"post_10573614","date":"20140615-00:00:00 -0400","authorID":"/personal_pages/user/9283747"},{"content":"Lucinda states up front and right away that you will never be cured.  How you missed that?  She said, too you will get your life back and you have.  Good for you!!  You did well!  Very well indeed.","author":"jetblst","replyTo":"/personal_pages/user/213375","postID":"post_11035757","date":"20140901-16:44:47 -0400","authorID":"/personal_pages/user/10356677"},{"content":"Well, when you add up the cost of all the meds, visits to the doctor, lost work, etc, from anxiety and depression, you purchased a bargain solution.","author":"jetblst","replyTo":"/personal_pages/user/299912","postID":"post_11035764","date":"20140901-16:44:47 -0400","authorID":"/personal_pages/user/10356677"},{"content":"The deal with stress and anxiety/depression is that it is a behavioral issue.  There is some heredity to this but how you respond or act to stress is behavioral. If you are sold out to the modern medicine methods then you will stay in your anxiety.  A few posts ripped Lucinda here for wanting this to be about money.  Really?  I guess the medical field do what they do for free and not to make a profit.   This program works, if you work it.  But that is true for any other endeavor we undertake. If you go step by step through this program you see very shortly how it works, and works well. Many of Lucinda's clients include top execs of many firms like Chrysler, McDonalds etc.  Those people would not go to MWC.   ","author":"jetblst","postID":"post_11035781","date":"20140901-16:44:47 -0400","authorID":"/personal_pages/user/10356677"}],"URL":"http://www.medhelp.org/posts/Anxiety/Does-the-Lucinda-Bassett-program-work/show/504550"}