{"title":"Allergies At 42?","thread":[{"content":"I'm turning 42 next month, and I'm thinking I might have an allergy. I've never had any in the past. But, I have a constant phlegm in my throat. I have to clear my thoat or cough and it will go away for a while and then come back. I have no other allergy symptoms. It's not real bad, but I've had it for a couple of months now. I'm wondering if maybe I've got an allergy to something now. Is it common to get them later in life?","author":"Mr_Tony","postID":"/3/allergies-exchange/forum/2088","date":"20120904-17:10:31 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/22708813"},{"content":"Hi, Allergies can start at any age, so, yes, you can be suffering allergy symptoms. You may also want to consider acid reflux. That can also cause the constant phlegm, stuffy runny nose... I hope that helps you some. Feel better and God bless, Sonya","author":"sgbl88","postID":"/3/allergies-exchange/forum/2088/0","date":"20120905-20:22:04 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/5923494"},{"content":"Hi Mr_Tony! Here is some information from here on our site about Who Gets Allergies . I hope this will get you started. There is lots of great information here at WebMD, especially in our Allergies Health Center . Have you talked to your doctor about your symptoms? That might be a perfect first step. Olivia","author":"Olivia_WebMD_Staff","postID":"/3/allergies-exchange/forum/2088/1","date":"20120917-08:43:17 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/4864033"},{"content":"After reading almost all 109 replies, I have some assumptions to make: 1) Most of the respondents are in the same age bracket. 2) How many of the total respondents have had a FLU shot in the past year. 3) Food manufacturers are putting a lot of crap and fillers into their food that they didn't use years ago. It is all about the almighty dollar. And if sawdust can make them an extra buck, they will use sawdust or something like it. 4) I am 62 now and my allergies have increased 10 fold since I was 40. Had my one and only Flu shot at age 40, never again. 5) Almost all food manufacturers are foreign owned now, within our own country. Perhaps not all foreign owned companies have our best interests and longevity at heart. Think about that one. 6) Try not to eat anything pre-made. 7) Corn which is a great \"filler\" has been modified by Monsanto and others. The corn of today is not the corn of years ago. GM modified foods are creating a lot of allergies.","author":"anita532","postID":"/3/allergies-exchange/forum/2088/2","date":"20120917-12:20:13 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/16267288"},{"content":"I am 60 years of age and have seen my allergies go from nothing to: Cigg smoke, dust and the list goes on and on. The last 10 years has been the worse for me! Its was in my 40's when dust started giving me a problem. I am on Allergy med's and could not live without them. I am now going to a lung doctor because of my years of smoking. No flu shot here.","author":"TexasLou","replyTo":"/3/allergies-exchange/forum/2088/2","postID":"/3/allergies-exchange/forum/2088/3","date":"20120917-12:47:16 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/21914857"},{"content":"TexasLou: Hope you have a good lung specialist. I am still a smoker inspite of asthma and double pneumonia, etc. I agree that dust is a greater problem than it used to be. My asthma started from stress and the loss of my entire family at age 45. They had to do emergency surgey to clean out my lungs. Am now on puffers when needed. My saving grace is Flovent, a steroid puffer. Hard to get used to, but it keeps me going. Make sure your doctor talks to you about Flovent.","author":"anita532","replyTo":"/3/allergies-exchange/forum/2088/3","postID":"/3/allergies-exchange/forum/2088/4","date":"20120917-15:06:15 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/16267288"},{"content":"Not to mention the tons of Glyphosate (Roundup) that is dumped on these genetically modified (GM) crops. The introduced protiens in GM crops are not recognized by are bodies and is percieved as a foriegn invader. Could this be the cause of the epidemic of allergy related problems? Hmmm.","author":"Mark52000","replyTo":"/3/allergies-exchange/forum/2088/2","postID":"/3/allergies-exchange/forum/2088/5","date":"20120922-07:47:07 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/16642877"},{"content":"Just like 'sgbl88' said A person can develop an allergy at any age, any time - so yes - could be an allergy. However, without a history of allergies, you need to check out reflux. Even if you are not having pain from heartburn you could have enough reflux to keep the airway irritated, producing more mucus to protect itself and get all those symptoms. I know because I have issues with both.","author":"4CharlotteB","postID":"/3/allergies-exchange/forum/2088/6","date":"20120922-10:00:18 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/22914775"},{"content":"Like you, I have a constant phlegm in my throat. I'm 71 and have had the problem for around three years. I too never experienced allergy problems before. My doctor says it's due to constant sinus drainage and has prescribed Nasonex inhalant twice a day. It \"un-snuffs\" my nose, but doesn't reduce the drainage that I can tell. If you discover something that stops the phlegm, or if anyone reading these posts knows of anything, please share.","author":"fuzzyvision","postID":"/3/allergies-exchange/forum/2088/7","date":"20120922-12:43:03 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/7095152"},{"content":"Well, now that you are older, your age must be the problem. No, I do not actually believe this. Perhaps you smoke, and long term smoking or second hand smoke has finally caught up, and you are now intolerant of any substance irritating your nasal membranes. Perhaps arthritis has set in and you now take aspirin daily or NSAIDs such as Aleve or Motrin or Advil or others in this category. Side affect of these medications with chronic use is rhinitis, rhino for your nose, and itis meaning inflammation. It took me 8 years before I came across this connection. Apparently, asthmatics may react to aspirin, and those sensitive to aspirin have a sensitivity to NSAIDs. End result, chronic sinus allergies that disappear with cessation of Motrin. If the drainage is clear, you are probably looking at an allergic response, but what changes when it goes away and comes back? Time of year, over the counter medications, visiting someone with a pet, seasonal changes in diet? You might want to look at those. A scratchy throat and phlegm especially worse on rising in the morning, may be acid reflux that occurs while you are asleep, and hence you should stop eating at least 6 hours before bed, and only water after stopping eating. Acid reflux that arrived for no reason at all, may represent increasing body size, exerting pressure on the stomach forcing it and the end portion of the esophagus upward, causing the sphincter to be forced open and regurgitation of stomach contents. Did I say 'Rhinitis Medicamentosa' or allergies caused by other medications you are on, such as hormone replacement therapy for women. Rebound affect with excess nasal sprays. I was taught years ago by an environmental physician, that one should consider their allergies to be contained in a bucket. When the bucket is in balance, there may be no symptoms. When your immune system is taxed, or the bucket is full, one more thing and it overflows, as well as your nose. Poetry not intended.","author":"CAMMSNNP","postID":"/3/allergies-exchange/forum/2088/8","date":"20120922-14:49:43 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/22719899"},{"content":"Well, I'm turning 57 in December. Never had any allergies until I hit menopause. Now I am allergic to shrimp, sensitive to lactose and food additives make me itch for three days, like gnats bites.","author":"barbaramiami","postID":"/3/allergies-exchange/forum/2088/9","date":"20120922-16:13:15 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/16926498"},{"content":"I am very close to you in age, and I have allergies as well as asthma (along with other problems many of us have with age). For me it helps to use Singulair (which I use every day at 7 PM), and I could not sleep if not for Breathe Right Nasal Strips. Currently I'm having nearly continual asthma problems, severe. My husband and I are trying to figure out why suddenly, again, this is so bad. I sleep with oxygen, since for some reason I don't breathe as deeply when sound asleep, but find I need it a LOT during the day over the past few weeks. My doctor changed my pain medication last month from hydrocodone to oxycodone, and it helps much better control my pain. But the pharmacy also switched me from Singulair to the generic form Montekulast, and I suspect the carrier in it may have triggered this.I'm using my nebulizer several times a day, and my Combivent, but still find I come close to 'blacking out' even sitting at my computer. Anyone with info, please let me know?","author":"LaLoba","replyTo":"/3/allergies-exchange/forum/2088/7","postID":"/3/allergies-exchange/forum/2088/11","date":"20120927-17:30:38 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/22979659"},{"content":"Most of your suspicions are correct. Are you not taking Flovent. Please get onto Flovent if you are not already taking it. Hard to get used to but worth the effort. Perhaps you will be able to get off the oxygen once you are stabilized on Flovent. Secondly, have you had your thyroid checked properly. This is important. It is now September and you have to remember that all those leaves have MOULD under them. Mould can really cut off your breath. In a big way. Close all your windows. Sorry bout that but it is sooo necessary. Here in Canada we were told many years ago that Combivent is no longer available, so now we have to carry two different inhalers in our purses. Stupid governent, allowing other drug companies to rip us off. And nobody really wants to carry two inhalers when one was sufficient. LaLoba - it is possible you have a need for a bronchoscopy. Google thiat. And perhaps change your pain medication again. They can play havoc with asthma. My prayers are with you. Good luck. You can overcome this even though it may not seem like it right now.","author":"anita532","replyTo":"/3/allergies-exchange/forum/2088/11","postID":"/3/allergies-exchange/forum/2088/12","date":"20120928-02:28:27 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/16267288"},{"content":"Thanks. Quite a comprehensive reply. I smoked for more years than I like to remember, but quit around 15 years ago. I do take a baby aspirin daily as heart therapy, and have to balance those advertised benefits with the constant discomfort of the nasal drainage and phlegm. Your reference to aging was funny, but how I wish there were some valid lists of what to expect as you age. I know this is practically impossible, since all of us age differently, but something like that might be reassuring. I know that just finding, and now reading this site as new posts arrive has made me a little less hyper about my symptoms. Interestingly, or perhaps I should say disturbingly, both my 69 year old wife and 42 year old son are now also complaing and seeing doctors for their breathing difficulties. We spent 23 years in the Army, moving around the country and world every three years, and I now wonder if we might have been exposed to some environmentsl causative. My son has been on his own for around 20 years now--at least geographically. We've lived in this same house for 28 years now and I'm wondering if something like Radon might be the problem.","author":"fuzzyvision","replyTo":"/3/allergies-exchange/forum/2088/8","postID":"/3/allergies-exchange/forum/2088/13","date":"20120929-13:04:47 -0400","authorID":"http://exchanges.webmd.com/allergies-exchange/groupstory/7095152"}],"URL":"/3/allergies-exchange/forum/2088"}